<!DOCTYPE html>



  


<html class="theme-next gemini use-motion" lang="zh-Hans">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>
<meta name="theme-color" content="#222">









<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />
















  
  
  <link href="/lib/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />







<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.1.4" rel="stylesheet" type="text/css" />


  <link rel="apple-touch-icon" sizes="180x180" href="/images/apple-touch-icon-next.png?v=5.1.4">


  <link rel="icon" type="image/png" sizes="32x32" href="/images/favicon-32x32-next.png?v=5.1.4">


  <link rel="icon" type="image/png" sizes="16x16" href="/images/favicon-16x16-next.png?v=5.1.4">


  <link rel="mask-icon" href="/images/logo.svg?v=5.1.4" color="#222">





  <meta name="keywords" content="NertWork," />










<meta name="description" content="&amp;#x5199;&amp;#x4E8E;20&amp;#x5E74;&amp;#x7684;&amp;#x4E00;&amp;#x7BC7;&amp;#x6587;&amp;#x3002;  &amp;#x6D41;&amp;#x91CF;&amp;#x8BC6;&amp;#x522B;&amp;#x6280;&amp;#x672F;&amp;#x7814;&amp;#x7A76;&amp;#x6458;&amp;#x8981;&amp;#x6D41;&amp;#x91CF;&amp;#x8BC6;&amp;#x522B;&amp;#x65E8;&amp;#x5728;&amp;#x">
<meta property="og:type" content="article">
<meta property="og:title" content="流量识别概述">
<meta property="og:url" content="http://yoursite.com/2021/02/12/%E6%B5%81%E9%87%8F%E8%AF%86%E5%88%AB%E6%A6%82%E8%BF%B0/index.html">
<meta property="og:site_name" content="HEATAO&#39;s Blog">
<meta property="og:description" content="&amp;#x5199;&amp;#x4E8E;20&amp;#x5E74;&amp;#x7684;&amp;#x4E00;&amp;#x7BC7;&amp;#x6587;&amp;#x3002;  &amp;#x6D41;&amp;#x91CF;&amp;#x8BC6;&amp;#x522B;&amp;#x6280;&amp;#x672F;&amp;#x7814;&amp;#x7A76;&amp;#x6458;&amp;#x8981;&amp;#x6D41;&amp;#x91CF;&amp;#x8BC6;&amp;#x522B;&amp;#x65E8;&amp;#x5728;&amp;#x">
<meta property="og:locale">
<meta property="og:image" content="http://yoursite.com/2021/02/12/%E6%B5%81%E9%87%8F%E8%AF%86%E5%88%AB%E6%A6%82%E8%BF%B0/20160601211229349.jpg">
<meta property="article:published_time" content="2021-02-12T14:03:16.000Z">
<meta property="article:modified_time" content="2021-07-24T01:27:18.678Z">
<meta property="article:author" content="HEATAO">
<meta property="article:tag" content="NertWork">
<meta name="twitter:card" content="summary">
<meta name="twitter:image" content="http://yoursite.com/2021/02/12/%E6%B5%81%E9%87%8F%E8%AF%86%E5%88%AB%E6%A6%82%E8%BF%B0/20160601211229349.jpg">



<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '',
    scheme: 'Gemini',
    version: '5.1.4',
    sidebar: {"position":"left","display":"post","offset":12,"b2t":false,"scrollpercent":false,"onmobile":false},
    fancybox: true,
    tabs: true,
    motion: {"enable":true,"async":false,"transition":{"post_block":"fadeIn","post_header":"slideDownIn","post_body":"slideDownIn","coll_header":"slideLeftIn","sidebar":"slideUpIn"}},
    duoshuo: {
      userId: '0',
      author: '博主'
    },
    algolia: {
      applicationID: '',
      apiKey: '',
      indexName: '',
      hits: {"per_page":10},
      labels: {"input_placeholder":"Search for Posts","hits_empty":"We didn't find any results for the search: ${query}","hits_stats":"${hits} results found in ${time} ms"}
    }
  };
</script>



  <link rel="canonical" href="http://yoursite.com/2021/02/12/流量识别概述/"/>





  <title>流量识别概述 | HEATAO's Blog</title>
  








<meta name="generator" content="Hexo 5.4.0"></head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  
  
    
  

  <div class="container sidebar-position-left page-post-detail">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-brand-wrapper">
  <div class="site-meta ">
    

    <div class="custom-logo-site-title">
      <a href="/"  class="brand" rel="start">
        <span class="logo-line-before"><i></i></span>
        <span class="site-title">HEATAO's Blog</span>
        <span class="logo-line-after"><i></i></span>
      </a>
    </div>
      
        <h1 class="site-subtitle" itemprop="description"></h1>
      
  </div>

  <div class="site-nav-toggle">
    <button>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
      <span class="btn-bar"></span>
    </button>
  </div>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      

      
    </ul>
  

  
</nav>



 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  

  
  
  

  <article class="post post-type-normal" itemscope itemtype="http://schema.org/Article">
  
  
  
  <div class="post-block">
    <link itemprop="mainEntityOfPage" href="http://yoursite.com/2021/02/12/%E6%B5%81%E9%87%8F%E8%AF%86%E5%88%AB%E6%A6%82%E8%BF%B0/">

    <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
      <meta itemprop="name" content="">
      <meta itemprop="description" content="">
      <meta itemprop="image" content="/images/me2.png">
    </span>

    <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
      <meta itemprop="name" content="HEATAO's Blog">
    </span>

    
      <header class="post-header">

        
        
          <h2 class="post-title" itemprop="name headline">流量识别概述</h2>
        

        <div class="post-meta">
          <span class="post-time">
            
              <span class="post-meta-item-icon">
                <i class="fa fa-calendar-o"></i>
              </span>
              
                <span class="post-meta-item-text">发表于</span>
              
              <time title="创建于" itemprop="dateCreated datePublished" datetime="2021-02-12T22:03:16+08:00">
                2021-02-12
              </time>
            

            

            
          </span>

          

          
            
          

          
          

          

          

          

        </div>
      </header>
    

    
    
    
    <div class="post-body" itemprop="articleBody">

      
      

      
        <blockquote>
<p>&#x5199;&#x4E8E;20&#x5E74;&#x7684;&#x4E00;&#x7BC7;&#x6587;&#x3002;</p>
</blockquote>
<h1 id="&#x6D41;&#x91CF;&#x8BC6;&#x522B;&#x6280;&#x672F;&#x7814;&#x7A76;"><a href="#&#x6D41;&#x91CF;&#x8BC6;&#x522B;&#x6280;&#x672F;&#x7814;&#x7A76;" class="headerlink" title="&#x6D41;&#x91CF;&#x8BC6;&#x522B;&#x6280;&#x672F;&#x7814;&#x7A76;"></a>&#x6D41;&#x91CF;&#x8BC6;&#x522B;&#x6280;&#x672F;&#x7814;&#x7A76;</h1><h2 id="&#x6458;&#x8981;"><a href="#&#x6458;&#x8981;" class="headerlink" title="&#x6458;&#x8981;"></a>&#x6458;&#x8981;</h2><p>&#x6D41;&#x91CF;&#x8BC6;&#x522B;&#x65E8;&#x5728;&#x4ECE;&#x7F51;&#x7EDC;&#x6D41;&#x91CF;&#x4E2D;&#x5206;&#x7C7B;&#x51FA;&#x7279;&#x5B9A;&#x7C7B;&#x522B;&#x7684;&#x6D41;&#x91CF;&#xFF0C;&#x53EF;&#x4EE5;&#x662F;&#x7279;&#x5B9A;&#x5E94;&#x7528;&#x7684;&#x6D41;&#x91CF;&#xFF0C;&#x5E94;&#x7528;&#x7684;&#x884C;&#x4E3A;&#xFF0C;&#x6076;&#x610F;&#x6D41;&#x91CF;&#x7B49;&#x7B49;&#x3002;&#x6D41;&#x91CF;&#x8BC6;&#x522B;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x4F20;&#x7EDF;&#x7684;&#x7F51;&#x7EDC;&#x6280;&#x672F;&#xFF0C;&#x5DF2;&#x7ECF;&#x7814;&#x7A76;&#x4E86;&#x4E8C;&#x5341;&#x591A;&#x5E74;&#xFF0C;&#x5E76;&#x5728;&#x5165;&#x4FB5;&#x68C0;&#x6D4B;&#x7CFB;&#x7EDF;&#x7B49;&#x5B89;&#x5168;&#x5E94;&#x7528;&#x4E2D;&#x5E7F;&#x6CDB;&#x4F7F;&#x7528;&#x3002;&#x4F20;&#x7EDF;&#x7684;&#x6D41;&#x91CF;&#x8BC6;&#x522B;&#x6839;&#x636E;&#x7AEF;&#x53E3;&#x53F7;&#xFF0C;&#x534F;&#x8BAE;&#x7B49;&#x7279;&#x5F81;&#x8FDB;&#x884C;&#x8BC6;&#x522B;&#xFF0C;&#x4F46;&#x8FD1;&#x5E74;&#x6765;&#xFF0C;&#x51FA;&#x4E8E;&#x5BF9;&#x5B89;&#x5168;&#x548C;&#x9690;&#x79C1;&#x7684;&#x8003;&#x8651;&#xFF0C;&#x52A0;&#x5BC6;&#x6D41;&#x91CF;&#x6FC0;&#x589E;&#xFF0C;&#x4E3A;&#x6D41;&#x91CF;&#x8BC6;&#x522B;&#x5E26;&#x6765;&#x4E86;&#x65B0;&#x6311;&#x6218;&#x3002;&#x5728;&#x672C;&#x6587;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5BF9;&#x73B0;&#x6709;&#x7684;&#x6D41;&#x91CF;&#x5206;&#x7C7B;&#x6280;&#x672F;&#x8FDB;&#x884C;&#x4E86;&#x4ECB;&#x7ECD;&#xFF0C;&#x4E0D;&#x4EC5;&#x5305;&#x62EC;&#x4F20;&#x7EDF;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x8FD8;&#x5305;&#x62EC;&#x6700;&#x8FD1;&#x7684;&#x6280;&#x672F;&#x548C;&#x8D8B;&#x52BF;&#x3002;&#x9664;&#x6B64;&#x4E4B;&#x5916;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x5BF9;&#x6D41;&#x91CF;&#x5206;&#x7C7B;&#x4EFB;&#x52A1;&#x6839;&#x636E;&#x5176;&#x5E94;&#x7528;&#x573A;&#x666F;&#x548C;&#x7279;&#x70B9;&#x8FDB;&#x884C;&#x4E86;&#x8FDB;&#x4E00;&#x6B65;&#x7684;&#x5212;&#x5206;&#xFF0C;&#x8BA8;&#x8BBA;&#x4E86;&#x9002;&#x7528;&#x4E8E;&#x4E0D;&#x540C;&#x4EFB;&#x52A1;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x4E86;&#x6D41;&#x91CF;&#x5206;&#x7C7B;&#x672A;&#x6765;&#x53EF;&#x80FD;&#x7684;&#x53D1;&#x5C55;&#x65B9;&#x5411;&#x548C;&#x6311;&#x6218;&#x3002;</p>
<h2 id="&#x4EFB;&#x52A1;&#x5B9A;&#x4E49;"><a href="#&#x4EFB;&#x52A1;&#x5B9A;&#x4E49;" class="headerlink" title="&#x4EFB;&#x52A1;&#x5B9A;&#x4E49;"></a>&#x4EFB;&#x52A1;&#x5B9A;&#x4E49;</h2><p>&#x6D41;&#x91CF;&#x8BC6;&#x522B;&#x65E8;&#x5728;&#x8BC6;&#x522B;&#x6D41;&#x91CF;&#x7684;&#x610F;&#x56FE;&#xFF0C;&#x7C7B;&#x522B;&#x3002;&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x6D41;&#x91CF;&#x6307;&#x7684;&#x662F;&#x5728;&#x7F51;&#x7EDC;&#x4E2D;&#x4F20;&#x8F93;&#x7684;&#x6570;&#x636E;&#x5305;&#x3002;</p>
<p>&#x5176;&#x6E90;&#x5934;&#x662F;&#x5E94;&#x7528;&#x5C42;&#x7684;&#x8BFB;&#x5199;&#x64CD;&#x4F5C;&#xFF0C;&#x7ECF;&#x8FC7;&#x4F20;&#x8F93;&#x5C42;&#x534F;&#x8BAE;&#x7684;&#x53D8;&#x6362;&#xFF08;&#x5206;&#x7247;&#x3001;&#x534F;&#x8BAE;&#x72B6;&#x6001;&#x673A;&#x3001;&#x52A0;&#x5BC6;&#x7B49;&#xFF09;&#xFF0C;&#x6D41;&#x91CF;&#x5E8F;&#x5217;&#x4EA7;&#x751F;&#x4E00;&#x5B9A;&#x53D8;&#x5316;&#x3002;&#x4F46;&#x662F;&#x8FD9;&#x79CD;&#x53D8;&#x5316;&#x975E;&#x5E38;&#x6709;&#x9650;&#xFF0C;&#x56E0;&#x4E3A;&#x6D41;&#x91CF;&#x7684;&#x53D1;&#x751F;&#x8FC7;&#x7A0B;&#x672C;&#x8D28;&#x662F;&#x786E;&#x5B9A;&#x6027;&#x7684;&#xFF0C;&#x968F;&#x673A;&#x56E0;&#x7D20;&#x8F83;&#x5C0F;&#xFF0C;&#x56E0;&#x6B64;&#x5BF9;&#x4E8E;&#x7279;&#x5B9A;&#x73AF;&#x5883;&#x4E2D;&#x7684;&#x7279;&#x5B9A;&#x5E94;&#x7528;&#xFF08;&#x6D4F;&#x89C8;&#x5668;&#x8BBF;&#x95EE; google.com&#xFF09;&#x5404;&#x79CD;&#x6D41;&#x91CF;&#x7279;&#x5F81;&#x4F53;&#x73B0;&#x51FA;&#x76F8;&#x5F53;&#x5927;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x548C;&#x72EC;&#x7279;&#x6027;&#xFF0C;&#x8FD9;&#x5C31;&#x4F7F;&#x201C;&#x4ECE;&#x6D41;&#x91CF;&#x7279;&#x5F81;&#x8BC6;&#x522B;&#x5E94;&#x7528;&#x201D;&#x7684;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x95EE;&#x9898;&#x6210;&#x4E3A;&#x53EF;&#x80FD;&#x3002;</p>
<img src="/2021/02/12/%E6%B5%81%E9%87%8F%E8%AF%86%E5%88%AB%E6%A6%82%E8%BF%B0/20160601211229349.jpg" alt="20160601211229349" style="zoom:80%;">

<p>&#x6839;&#x636E;&#x6D41;&#x91CF;&#x610F;&#x56FE;&#x7684;&#x4E0D;&#x540C;&#xFF0C;&#x6D41;&#x91CF;&#x5728;&#x4F20;&#x8F93;&#x8FC7;&#x7A0B;&#x4E2D;&#x4F1A;&#x5E26;&#x6709;&#x5F88;&#x591A;&#x7279;&#x5F81;&#xFF0C;&#x4E00;&#x4E9B;&#x5DE5;&#x4F5C;&#x5229;&#x7528;&#x5355;&#x4E2A;&#x6570;&#x636E;&#x5305;&#x7684;&#x7279;&#x5F81;&#x5BF9;&#x6D41;&#x91CF;&#x8FDB;&#x884C;&#x8BC6;&#x522B;&#xFF0C;&#x4E00;&#x4E9B;&#x5DE5;&#x4F5C;&#x5219;&#x5BF9;&#x6574;&#x4E2A;&#x7F51;&#x7EDC;&#x6570;&#x636E;&#x5305;&#x6D41;&#x8FDB;&#x884C;&#x5904;&#x7406;&#xFF0C;&#x8FD9;&#x4F1A;&#x6839;&#x636E;&#x4EFB;&#x52A1;&#x5177;&#x4F53;&#x7684;&#x76EE;&#x6807;&#x4E0D;&#x540C;&#x800C;&#x6709;&#x6240;&#x53D8;&#x5316;&#x3002;</p>
<p>&#x8FDB;&#x884C;&#x6D41;&#x91CF;&#x8BC6;&#x522B;&#x7684;&#x7B2C;&#x4E00;&#x6B65;&#x662F;&#x660E;&#x786E;&#x8BC6;&#x522B;&#x7684;&#x76EE;&#x6807;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E0D;&#x540C;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x7531;&#x4E8E;&#x6570;&#x636E;&#x7684;&#x7279;&#x70B9;&#x548C;&#x6D41;&#x91CF;&#x7684;&#x610F;&#x56FE;&#x4E0D;&#x540C;&#xFF0C;&#x6240;&#x91C7;&#x7528;&#x7684;&#x65B9;&#x6CD5;&#x4E5F;&#x6709;&#x6240;&#x4E0D;&#x540C;&#x3002;&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x4ECE;&#x4EFB;&#x52A1;&#x7684;&#x76EE;&#x6807;&#x89D2;&#x5EA6;&#xFF0C;&#x5BF9;&#x5E38;&#x89C1;&#x7684;&#x6D41;&#x91CF;&#x8BC6;&#x522B;&#x4EFB;&#x52A1;&#x8FDB;&#x884C;&#x4E86;&#x5212;&#x5206;&#x3002;</p>
<h3 id="&#x5E94;&#x7528;&#x6D41;&#x91CF;&#x5206;&#x7C7B;"><a href="#&#x5E94;&#x7528;&#x6D41;&#x91CF;&#x5206;&#x7C7B;" class="headerlink" title="&#x5E94;&#x7528;&#x6D41;&#x91CF;&#x5206;&#x7C7B;"></a>&#x5E94;&#x7528;&#x6D41;&#x91CF;&#x5206;&#x7C7B;</h3><p>&#x5E94;&#x7528;&#x6D41;&#x91CF;&#x5206;&#x7C7B;&#x662F;&#x6D41;&#x91CF;&#x8BC6;&#x522B;&#x4E2D;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x8BE5;&#x4EFB;&#x52A1;&#x901A;&#x5E38;&#x7684;&#x505A;&#x6CD5;&#x662F;&#xFF0C;&#x5BF9;&#x7279;&#x5B9A;&#x9886;&#x57DF;&#x6216;&#x8005;&#x5BF9;&#x5E38;&#x7528;&#x7684;&#x5E94;&#x7528;&#x901A;&#x8FC7;&#x6D41;&#x91CF;&#x8FDB;&#x884C;&#x533A;&#x5206;&#x3002;&#x901A;&#x8FC7;&#x5BF9;&#x5E94;&#x7528;&#x6D41;&#x91CF;&#x8FDB;&#x884C;&#x533A;&#x5206;&#xFF0C;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#x53EF;&#x4EE5;&#x5BF9;&#x7528;&#x6237;&#x9690;&#x79C1;&#x9020;&#x6210;&#x5A01;&#x80C1;&#xFF0C;&#x4F8B;&#x5982;&#x4E86;&#x89E3;&#x7528;&#x6237;&#x7684;&#x533B;&#x7597;&#x72B6;&#x51B5;&#xFF0C;&#x6027;&#x53D6;&#x5411;&#x6216;&#x5B97;&#x6559;&#x4FE1;&#x4EF0;&#x3002;&#x8BE5;&#x4EFB;&#x52A1;&#x5728;&#x4E00;&#x4E9B;&#x573A;&#x666F;&#x4E5F;&#x6709;&#x7279;&#x5B9A;&#x4F5C;&#x7528;&#xFF0C;&#x6BD4;&#x5982;&#x4FC4;&#x7F57;&#x65AF;&#xFF0C;&#x5370;&#x5EA6;&#x7B49;&#x56FD;&#x7684;&#x6D41;&#x91CF;&#x5BA1;&#x67E5;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x7531;&#x4E8E;&#x76EE;&#x524D;&#x52A0;&#x5BC6;&#x6D41;&#x91CF;&#x68C0;&#x6D4B;&#x96BE;&#x5EA6;&#x7684;&#x589E;&#x5927;&#xFF0C;&#x7F51;&#x7EDC;&#x9ED1;&#x4EA7;&#x5229;&#x7528;&#x722C;&#x866B;&#xFF0C;&#x5237;&#x6D41;&#x91CF;&#xFF0C;&#x64B8;&#x7F8A;&#x6BDB;&#xFF0C;&#x6270;&#x4E71;&#x6B63;&#x5E38;&#x7F51;&#x7EDC;&#x79E9;&#x5E8F;&#xFF0C;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x8FD9;&#x4E00;&#x95EE;&#x9898;&#xFF0C;&#x6025;&#x9700;&#x8981;&#x66F4;&#x6709;&#x6548;&#x7684;&#x624B;&#x6BB5;&#x5BF9;&#x5E94;&#x7528;&#x6D41;&#x91CF;&#x8FDB;&#x884C;&#x8BC6;&#x522B;&#x3002;</p>
<p>&#x76EE;&#x524D;&#x7EDD;&#x5927;&#x90E8;&#x5206;&#x7684;&#x5E94;&#x7528;&#x90FD;&#x901A;&#x8FC7;&#x52A0;&#x5BC6;&#x6D41;&#x91CF;&#x8FDB;&#x884C;&#x6570;&#x636E;&#x4F20;&#x8F93;&#xFF0C;&#x8FD9;&#x4F7F;&#x5F97;&#x8FC7;&#x53BB;&#x5229;&#x7528;IP&#x4E94;&#x5143;&#x7EC4;&#x7684;&#x65B9;&#x6CD5;&#x5931;&#x6548;&#xFF0C;&#x5F88;&#x591A;&#x5DE5;&#x4F5C;&#x56E0;&#x6B64;&#x5229;&#x7528;&#x4E86;&#x7EDF;&#x8BA1;&#x7279;&#x5F81;&#x548C;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x65B9;&#x6CD5;&#x8FDB;&#x884C;&#x6D41;&#x91CF;&#x8BC6;&#x522B;&#xFF0C;[Cliu2018]&#x8003;&#x8651;&#x6D41;&#x4E2D;&#x5305;&#x4E4B;&#x95F4;&#x7684;&#x4F20;&#x9012;&#x5173;&#x7CFB;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x5C06;&#x591A;&#x4E2A;&#x5E94;&#x7528;&#x7684;&#x9A6C;&#x5C14;&#x79D1;&#x592B;&#x6982;&#x7387;&#x4F5C;&#x4E3A;&#x6D41;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x5728;&#x771F;&#x5B9E;&#x6D41;&#x91CF;&#x6570;&#x636E;&#x4E0B;&#x4ECD;&#x80FD;&#x53D6;&#x5F97;&#x5F88;&#x597D;&#x7684;&#x6548;&#x679C;&#x3002;</p>
<p>&#x5BF9;&#x5E94;&#x7528;&#x7684;&#x6D41;&#x91CF;&#x5206;&#x7C7B;&#x4E0D;&#x6B62;&#x5C40;&#x9650;&#x4E8E;PC&#x7AEF;&#xFF0C;[Taylor2017]&#x5BF9;Google Play&#x5546;&#x5E97;&#x4E2D;&#x7684;110&#x79CD;&#x6700;&#x6D41;&#x884C;&#x7684;&#x5E94;&#x7528;&#x8FDB;&#x884C;&#x4E86;&#x6307;&#x7EB9;&#x8BC6;&#x522B;&#xFF0C;&#x51C6;&#x786E;&#x6027;&#x8FBE;&#x5230;&#x4E86;96%&#x3002;[Sivanathan2019]&#x4F7F;&#x7528;&#x8BF8;&#x5982;&#x6D3B;&#x52A8;&#x5468;&#x671F;&#xFF0C;&#x7AEF;&#x53E3;&#x53F7;&#xFF0C;&#x4FE1;&#x4EE4;&#x6A21;&#x5F0F;&#x548C;&#x5BC6;&#x7801;&#x5957;&#x4EF6;&#x4E4B;&#x7C7B;&#x7684;&#x7EDF;&#x8BA1;&#x7279;&#x5F81;&#x5BF9;IOT&#x8BBE;&#x5907;&#x8FDB;&#x884C;&#x4E86;&#x8BC6;&#x522B;&#x3002;&#x4E00;&#x4E9B;&#x5DE5;&#x4F5C;&#x8FD8;&#x5C06;&#x5E94;&#x7528;&#x6D41;&#x91CF;&#x8BC6;&#x522B;&#x62D3;&#x5C55;&#x5230;&#x4E86;SDN&#x4E0A;&#xFF0C;[Cao2019]&#x5BF9;SDN&#x5E38;&#x89C1;&#x7684;10&#x79CD;&#x8F6F;&#x4EF6;&#x5728;&#x5B9E;&#x9A8C;&#x5BA4;&#x73AF;&#x5883;&#x4E2D;&#x6210;&#x529F;&#x5206;&#x7C7B;&#x3002;&#x8FD9;&#x4E9B;&#x5DE5;&#x4F5C;&#x8BC1;&#x660E;&#x4E86;&#x6D41;&#x91CF;&#x8BC6;&#x522B;&#x53EF;&#x4EE5;&#x88AB;&#x5E7F;&#x6CDB;&#x5E94;&#x7528;&#x5728;&#x5404;&#x4E2A;&#x573A;&#x666F;&#x4E0B;&#x3002;</p>
<p>&#x5E94;&#x7528;&#x6D41;&#x91CF;&#x8BC6;&#x522B;&#x867D;&#x7136;&#x5728;&#x5B9E;&#x9A8C;&#x5BA4;&#x5F80;&#x5F80;&#x53EF;&#x4EE5;&#x53D6;&#x5F97;90%&#x4EE5;&#x4E0A;&#x7684;&#x51C6;&#x786E;&#x7387;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x73B0;&#x5B9E;&#x4E2D;&#x7684;&#x6548;&#x679C;&#x4F1A;&#x4E0B;&#x964D;&#x4E0D;&#x5C11;&#xFF0C;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x5B9E;&#x9A8C;&#x5BA4;&#x7684;&#x73AF;&#x5883;&#x4E2D;&#x6D41;&#x91CF;&#x7C7B;&#x522B;&#x8F83;&#x5C11;&#xFF0C;&#x566A;&#x58F0;&#x8F83;&#x5C11;&#xFF0C;&#x5E76;&#x4E14;&#x73B0;&#x5B9E;&#x4E16;&#x754C;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x5206;&#x5E03;&#x662F;&#x96BE;&#x4EE5;&#x4F30;&#x8BA1;&#x7684;&#xFF0C;&#x8FD9;&#x4E0E;&#x5B9E;&#x9A8C;&#x5BA4;&#x6570;&#x636E;&#x96C6;&#x5F88;&#x53EF;&#x80FD;&#x4E0D;&#x4E00;&#x81F4;&#x3002;&#x5373;&#x4FBF;&#x5982;&#x6B64;&#xFF0C;&#x5F88;&#x591A;&#x5DE5;&#x4F5C;&#x5728;&#x73B0;&#x5B9E;&#x73AF;&#x5883;&#x4E2D;&#x6D4B;&#x8BD5;&#x4E5F;&#x80FD;&#x53D6;&#x5F97;&#x5F88;&#x597D;&#x7684;&#x6548;&#x679C;&#x3002;</p>
<h3 id="&#x7F51;&#x7AD9;&#x6307;&#x7EB9;"><a href="#&#x7F51;&#x7AD9;&#x6307;&#x7EB9;" class="headerlink" title="&#x7F51;&#x7AD9;&#x6307;&#x7EB9;"></a>&#x7F51;&#x7AD9;&#x6307;&#x7EB9;</h3><p>&#x7F51;&#x7AD9;&#x6307;&#x7EB9;&#xFF08;website fingerprinting&#xFF09;&#x7684;&#x76EE;&#x6807;&#x662F;&#x6839;&#x636E;&#x6D41;&#x91CF;&#x5BF9;&#x7528;&#x6237;&#x6240;&#x8BBF;&#x95EE;&#x7684;&#x7F51;&#x9875;&#x8FDB;&#x884C;&#x8BC6;&#x522B;&#x3002;&#x6700;&#x8FD1;&#x6709;&#x5F88;&#x591A;&#x7814;&#x7A76;&#x90FD;&#x8868;&#x660E;&#xFF0C;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x8BBF;&#x95EE;&#x7F51;&#x7AD9;&#x6240;&#x4EA7;&#x751F;&#x7684;&#x6D41;&#x91CF;&#x7684;&#x6570;&#x636E;&#x5305;&#x548C;&#x5927;&#x5C0F;&#x68C0;&#x6D4B;&#x7279;&#x5B9A;&#x7684;&#x7F51;&#x7AD9;&#x4FE1;&#x606F;[Rimmer2018]&#x3002;</p>
<p>&#x5728;&#x5B9E;&#x9A8C;&#x5BA4;&#x7684;&#x73AF;&#x5883;&#x4E2D;&#xFF0C;&#x91C7;&#x7528;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x7F51;&#x7AD9;&#x6307;&#x7EB9;&#x6280;&#x672F;&#x53EF;&#x4EE5;&#x53D6;&#x5F97;&#x5F88;&#x597D;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x771F;&#x5B9E;&#x73AF;&#x5883;&#x4E2D;&#x7684;&#x6548;&#x679C;&#x5F80;&#x5F80;&#x4F1A;&#x4E0B;&#x964D;&#x5F88;&#x591A;&#xFF0C;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x5F88;&#x591A;&#x7814;&#x7A76;&#x7684;&#x6570;&#x636E;&#x5728;&#x5B9E;&#x9A8C;&#x5BA4;&#x4E2D;&#x662F;&#x6709;&#x9650;&#x7684;&#xFF0C;&#x5206;&#x7C7B;&#x7684;&#x7C7B;&#x522B;&#x4E5F;&#x4E8B;&#x5148;&#x5B9A;&#x4E49;&#x597D;&#xFF0C;&#x5728;&#x9762;&#x5BF9;&#x771F;&#x5B9E;&#x4E16;&#x754C;&#x5927;&#x91CF;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x4E14;&#x8FD9;&#x4E2A;&#x6570;&#x636E;&#x4E0E;&#x5B9E;&#x9A8C;&#x5BA4;&#x4E0D;&#x4E00;&#x5B9A;&#x662F;&#x540C;&#x5206;&#x5E03;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8BAD;&#x7EC3;&#x51FA;&#x6765;&#x7684;&#x5206;&#x7C7B;&#x5668;&#x662F;&#x5426;&#x53EF;&#x7528;&#xFF1F;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x5C1A;&#x6709;&#x4E89;&#x8BBA;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x8BE5;&#x4EFB;&#x52A1;&#x800C;&#x8A00;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x5DE5;&#x4F5C;&#x91C7;&#x7528;&#x7684;&#x65B9;&#x6CD5;&#x4ECD;&#x662F;&#x63D0;&#x51FA;&#x7279;&#x5F81;&#x518D;&#x7528;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x8BAD;&#x7EC3;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x4F8B;&#x5982;[K. Liang2019]&#x5BF9;&#x4E8E;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x7279;&#x5F81;&#x4F7F;&#x7528;&#x7279;&#x5B9A;&#x7C7B;&#x578B;&#x7684;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x8FDB;&#x884C;&#x8BAD;&#x7EC3;&#xFF0C;&#x5C06;&#x6A21;&#x578B;&#x5E94;&#x7528;&#x4E8E;&#x7F51;&#x7AD9;&#x670D;&#x52A1;&#x5206;&#x7C7B;&#x4E2D;&#xFF0C;&#x4E00;&#x4E2A;&#x7F51;&#x7AD9;&#x670D;&#x52A1;&#x53EF;&#x80FD;&#x5305;&#x542B;&#x591A;&#x4E2A;&#x7F51;&#x9875;&#xFF0C;&#x4E3A;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x8BE5;&#x7F51;&#x7AD9;&#x4E0B;&#x7684;&#x4E00;&#x79CD;&#x7279;&#x5B9A;&#x670D;&#x52A1;&#xFF0C;&#x8BE5;&#x5DE5;&#x4F5C;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x8BC6;&#x522B;&#x7279;&#x5B9A;&#x7684;&#x7F51;&#x7AD9;&#x670D;&#x52A1;&#x3002;&#x5F88;&#x591A;&#x5DE5;&#x4F5C;&#x662F;&#x5728;&#x6B64;&#x6D41;&#x7A0B;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x89E3;&#x51B3;&#x4E00;&#x4E9B;&#x66F4;&#x7EC6;&#x5316;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6BD4;&#x5982;[Zeng X2018]&#x63D0;&#x51FA;&#x4F7F;&#x7528;&#x57FA;&#x4E8E;HTTP 1.1&#x534F;&#x8BAE;&#x5355; &#x8FDE;&#x63A5;&#x5185;&#x4E32;&#x884C;&#x8BF7;&#x6C42;&#x7279;&#x6027;&#x523B;&#x753B;&#x5355;&#x4E2A;Web&#x8D44;&#x6E90;&#x7684;&#x5C40;&#x90E8;&#x7279;&#x5F81;&#x6A21;&#x578B;&#xFF0C;&#x901A;&#x8FC7;&#x65F6;&#x95F4;&#x504F;&#x5E8F;&#x5173;&#x7CFB;&#x7684;&#x4E32;&#x8054;&#xFF0C;&#x63D0;&#x53D6;&#x524D;K&#x4E2A;&#x5C40;&#x90E8;&#x7279;&#x5F81;&#x96C6;&#xFF0C;&#x7ED3;&#x5408;&#x968F;&#x673A;&#x68EE; &#x6797;&#x7B97;&#x6CD5;&#xFF0C;&#x89E3;&#x51B3;&#x4E86;&#x4E91;&#x4E0A;&#x5355;IP&#x591A;&#x7F51;&#x7AD9;&#x96BE;&#x7CBE;&#x7EC6;&#x5316;&#x533A;&#x5206;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5B9E;&#x73B0;&#x6307;&#x7EB9;&#x5206;&#x7C7B;&#x3002;[Rimmer2018]&#x5219;&#x5229;&#x7528;&#x533F;&#x540D;&#x5316;&#x7F51;&#x7EDC;tor&#x7684;&#x7279;&#x6027;&#xFF0C;&#x91C7;&#x7528;&#x957F;&#x5EA6;&#x5E8F;&#x5217;&#x7684;&#x65B9;&#x5411;&#x5E8F;&#x5217;&#x4F5C;&#x4E3A;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x8F93;&#x5165;&#xFF0C;&#x4ECE;&#x800C;&#x5BF9;&#x8BBF;&#x95EE;&#x7684;&#x7F51;&#x9875;&#x8FDB;&#x884C;&#x5206;&#x7C7B;&#x3002;</p>
<p>&#x4E00;&#x4E9B;&#x7814;&#x7A76;&#x8BA4;&#x4E3A;&#x7F51;&#x7AD9;&#x6307;&#x7EB9;&#x653B;&#x51FB;&#x6839;&#x636E;&#x4E00;&#x5B9A;&#x7684;&#x6539;&#x8FDB;&#x5728;&#x771F;&#x662F;&#x73AF;&#x5883;&#x4ECD;&#x53EF;&#x884C;[Rimmer2018, Wang2016]&#xFF0C;&#x800C;&#x4E00;&#x4E9B;&#x7814;&#x7A76;[Panchenko2016]&#x8BA4;&#x4E3A;&#x5F88;&#x591A;&#x5173;&#x4E8E;&#x7F51;&#x7AD9;&#x6307;&#x7EB9;&#x7684;&#x7814;&#x7A76;&#x4EC5;&#x80FD;&#x8BC6;&#x522B;&#x4E00;&#x5B9A;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x65E0;&#x6CD5;&#x5F88;&#x597D;&#x7684;&#x63A8;&#x5E7F;&#x5230;&#x5F00;&#x653E;&#x4E16;&#x754C;&#x3002;</p>
<h3 id="&#x5E94;&#x7528;&#x884C;&#x4E3A;&#x5206;&#x7C7B;"><a href="#&#x5E94;&#x7528;&#x884C;&#x4E3A;&#x5206;&#x7C7B;" class="headerlink" title="&#x5E94;&#x7528;&#x884C;&#x4E3A;&#x5206;&#x7C7B;"></a>&#x5E94;&#x7528;&#x884C;&#x4E3A;&#x5206;&#x7C7B;</h3><p>&#x6D41;&#x91CF;&#x884C;&#x4E3A;&#x5206;&#x7C7B;&#x65E8;&#x5728;&#x8BC6;&#x522B;&#x6D41;&#x91CF;&#x7684;&#x610F;&#x56FE;&#xFF0C;&#x8BE5;&#x4EFB;&#x52A1;&#x5F88;&#x591A;&#x65F6;&#x5019;&#x4E0E;&#x5E94;&#x7528;&#x5206;&#x7C7B;&#x540C;&#x65F6;&#x8FDB;&#x884C;&#xFF0C;&#x540E;&#x8005;&#x8BC6;&#x522B;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x524D;&#x8005;&#x5728;&#x6B64;&#x57FA;&#x7840;&#x4E0A;&#x8BC6;&#x522B;&#x51FA;&#x5E94;&#x7528;&#x7684;&#x884C;&#x4E3A;&#x548C;&#x6B65;&#x9AA4;&#x3002;&#x884C;&#x4E3A;&#x5206;&#x6790;&#x53EF;&#x4EE5;&#x66B4;&#x9732;&#x7528;&#x6237;&#x7684;&#x9690;&#x79C1;&#xFF0C;&#x5206;&#x6790;&#x7528;&#x6237;&#x7684;&#x504F;&#x597D;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x5728;&#x6D41;&#x91CF;&#x6709;&#x4E00;&#x4E2A;&#x66F4;&#x4E3A;&#x5168;&#x9762;&#x7684;&#x4E86;&#x89E3;&#xFF0C;&#x5BF9;&#x70ED;&#x70B9;&#x8D44;&#x6E90;&#x8FDB;&#x884C;&#x5206;&#x6790;&#x3002;&#x4ECE;&#x5B89;&#x5168;&#x7684;&#x89D2;&#x5EA6;&#x800C;&#x8A00;&#xFF0C;&#x884C;&#x4E3A;&#x5206;&#x7C7B;&#x8FD8;&#x53EF;&#x4EE5;&#x8BC6;&#x522B;&#x51FA;&#x5177;&#x6709;&#x5F02;&#x5E38;&#x884C;&#x4E3A;&#x7684;&#x6D41;&#x91CF;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x503C;&#x5F97;&#x7814;&#x7A76;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x5217;&#x4E3E;&#x4E00;&#x4E9B;&#x76F8;&#x5173;&#x5DE5;&#x4F5C;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x7279;&#x5B9A;&#x5E94;&#x7528;&#x7684;&#x6D41;&#x91CF;&#x8BC6;&#x522B;&#x4F1A;&#x5BF9;&#x7528;&#x6237;&#x9690;&#x79C1;&#x9020;&#x6210;&#x5A01;&#x80C1;&#xFF0C;[Wang J2019]&#x63D0;&#x53D6;&#x52A0;&#x5BC6;&#x76F8;&#x673A;&#x6D41;&#x91CF;&#x4E2D;&#x7684;&#x7EDF;&#x8BA1;&#x7279;&#x5F81;&#x5E76;&#x4F7F;&#x7528;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x5206;&#x7C7B;&#xFF0C;&#x8BC1;&#x5B9E;&#x6839;&#x636E;&#x6D41;&#x91CF;&#x7279;&#x5F81;&#x53EF;&#x8BC6;&#x522B;&#x7528;&#x6237;&#x884C;&#x4E3A;&#x8FDB;&#x800C;&#x6784;&#x5EFA;&#x65E5;&#x5E38;&#x751F;&#x6D3B;&#x884C;&#x4E3A;&#x89C4;&#x5F8B;&#x3002;[Minghao2019]&#x91C7;&#x7528;&#x96C6;&#x6210;&#x5B66;&#x4E60;&#x548C;&#x51B3;&#x7B56;&#x6811;&#x7684;&#x65B9;&#x6CD5;&#x5BF9;&#x8FDC;&#x7A0B;&#x684C;&#x9762;&#x7684;&#x5404;&#x4E2A;&#x884C;&#x4E3A;&#x8FDB;&#x884C;&#x4E86;&#x6D41;&#x91CF;&#x8BC6;&#x522B;&#xFF0C;&#x5305;&#x62EC;&#x7F16;&#x8F91;&#x6587;&#x6863;&#xFF0C;&#x89C2;&#x770B;&#x89C6;&#x9891;&#xFF0C;&#x5B89;&#x88C5;&#x8F6F;&#x4EF6;&#x7B49;&#x7B49;&#xFF0C;&#x4ED6;&#x4EEC;&#x5229;&#x7528;&#x4E86;&#x8FDC;&#x7A0B;&#x684C;&#x9762;&#x7684;&#x4E00;&#x4E9B;&#x5E38;&#x7528;&#x534F;&#x8BAE;&#x4F5C;&#x4E3A;&#x7279;&#x5F81;&#x3002;&#x5176;&#x4ED6;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x7C7B;&#x4F3C;&#x7684;&#x5DE5;&#x4F5C;&#x6BD4;&#x5982;[Xliu2019]&#x5BF9;&#x6444;&#x50CF;&#x5934;&#x6D41;&#x91CF;&#x7684;&#x7528;&#x6237;&#x884C;&#x4E3A;&#x8FDB;&#x884C;&#x4E86;&#x9884;&#x6D4B;&#xFF0C;&#x8FD9;&#x4E9B;&#x5DE5;&#x4F5C;&#x5F80;&#x5F80;&#x662F;&#x5BF9;&#x7279;&#x5B9A;&#x529F;&#x80FD;&#x7684;&#x540C;&#x7C7B;&#x578B;APP&#x7684;&#x5404;&#x79CD;&#x884C;&#x4E3A;&#x8FDB;&#x884C;&#x8BC6;&#x522B;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x5176;&#x7279;&#x6709;&#x7684;&#x534F;&#x8BAE;&#x4F5C;&#x4E3A;&#x7279;&#x5F81;&#x3002;</p>
<h3 id="&#x6DF7;&#x6DC6;&#x6D41;&#x91CF;&#x8BC6;&#x522B;"><a href="#&#x6DF7;&#x6DC6;&#x6D41;&#x91CF;&#x8BC6;&#x522B;" class="headerlink" title="&#x6DF7;&#x6DC6;&#x6D41;&#x91CF;&#x8BC6;&#x522B;"></a>&#x6DF7;&#x6DC6;&#x6D41;&#x91CF;&#x8BC6;&#x522B;</h3><p>&#x5F88;&#x591A;&#x6839;&#x636E;&#x7EDF;&#x8BA1;&#x7279;&#x5F81;&#x8FDB;&#x884C;&#x6D41;&#x91CF;&#x8BC6;&#x522B;&#x7684;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x8FDB;&#x6D41;&#x91CF;&#x8FDB;&#x884C;&#x5F88;&#x597D;&#x7684;&#x5206;&#x7C7B;&#xFF0C;&#x66B4;&#x9732;&#x9690;&#x79C1;&#xFF0C;&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x8FD9;&#x4E00;&#x95EE;&#x9898;&#xFF0C;&#x53EF;&#x4EE5;&#x91C7;&#x7528;&#x6D41;&#x91CF;&#x6DF7;&#x6DC6;&#x7684;&#x65B9;&#x5F0F;&#x5BF9;&#x6D41;&#x91CF;&#x8FDB;&#x884C;&#x4F2A;&#x88C5;&#xFF0C;&#x6539;&#x53D8;&#x539F;&#x672C;&#x7684;&#x7279;&#x5F81;[Wright2009]&#x3002;&#x6D41;&#x91CF;&#x6DF7;&#x6DC6;&#x7684;&#x65B9;&#x5F0F;&#x5305;&#x62EC;&#x4E14;&#x4E0D;&#x9650;&#x4E8E;&#xFF1A;&#x6539;&#x53D8;&#x6570;&#x636E;&#x5305;&#x5927;&#x5C0F;&#xFF0C;&#x5C06;&#x6570;&#x636E;&#x5305;&#x4F2A;&#x88C5;&#x6210;&#x53E6;&#x5916;&#x884C;&#x4E3A;&#x6216;&#x5E94;&#x7528;&#x7684;&#x6D41;&#x91CF;&#xFF0C;&#x4F2A;&#x88C5;&#x6210;&#x4E0D;&#x540C;&#x7684;&#x534F;&#x8BAE;&#x3002;</p>
<p>&#x5728;[Dixon2016]&#x7684;&#x7EFC;&#x8FF0;&#x4E2D;&#x63D0;&#x5230;&#x4E0A;&#x8FF0;&#x6D41;&#x91CF;&#x4F2A;&#x88C5;&#x7684;&#x65B9;&#x5F0F;&#x5728;&#x7406;&#x8BBA;&#x4E0A;&#x53EF;&#x4EE5;&#x88AB;&#x8BC6;&#x522B;&#x3002;&#x5BF9;&#x4E8E;&#x586B;&#x5145;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x867D;&#x7136;&#x53EF;&#x4EE5;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x6539;&#x53D8;&#x6570;&#x636E;&#x5305;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x4F46;&#x662F;&#x4F1A;&#x5E26;&#x6765;&#x65B0;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x5E76;&#x4E14;&#x8BF8;&#x5982;&#x6570;&#x636E;&#x5305;&#x65F6;&#x95F4;&#x6233;&#x7B49;&#x7279;&#x5F81;&#x5E76;&#x4E0D;&#x80FD;&#x8FDB;&#x884C;&#x4F2A;&#x88C5;&#x3002;&#x5728;&#x6DF7;&#x6DC6;&#x6D41;&#x91CF;&#x8BC6;&#x522B;&#x65B9;&#x9762;&#x6709;&#x5F88;&#x591A;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;[xuemei2019]&#x91C7;&#x7528;&#x57FA;&#x4E8E;&#x6D41;&#x4E0A;&#x4E0B;&#x6587;&#x548C;&#x4E3B;&#x673A;&#x6D41;&#x884C;&#x4E3A;&#x548C;DNS&#x884C;&#x4E3A;&#x7684;&#x65B9;&#x5F0F;&#x5BF9;ShadowSocks&#x533F;&#x540D;&#x6D41;&#x91CF;&#x8FDB;&#x884C;&#x4E86;&#x8BC6;&#x522B;&#x3002;[Wang2015]&#x91C7;&#x7528;&#x4FE1;&#x606F;&#x71B5;&#x7684;&#x65B9;&#x5F0F;&#x5BF9;&#x91C7;&#x7528;&#x586B;&#x5145;&#x7684;&#x6DF7;&#x6DC6;&#x6D41;&#x91CF;&#x8FDB;&#x884C;&#x4E86;&#x8BC6;&#x522B;&#x3002;&#x5BF9;&#x6570;&#x636E;&#x5305;&#x8FDB;&#x884C;&#x53D8;&#x5F62;&#x540C;&#x6837;&#x4E5F;&#x4F1A;&#x6709;&#x7C7B;&#x4F3C;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x800C;&#x6A21;&#x4EFF;&#x6210;&#x5176;&#x4ED6;&#x534F;&#x8BAE;&#x7684;&#x96BE;&#x70B9;&#x5728;&#x4E8E;&#x662F;&#x5426;&#x80FD;&#x8FDB;&#x884C;&#x5B8C;&#x7F8E;&#x7684;&#x6A21;&#x4EFF;&#x3002;&#x8FD8;&#x6709;&#x5C06;&#x6D41;&#x91CF;&#x4F2A;&#x88C5;&#x6210;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x7279;&#x5F81;&#x7684;&#x6570;&#x636E;&#x5305;&#xFF0C;&#x4F46;&#x5E76;&#x4E0D;&#x80FD;&#x5B8C;&#x7F8E;&#x6D88;&#x9664;&#x7279;&#x5F81;&#xFF0C;&#x6709;&#x65F6;&#x6CA1;&#x6709;&#x7279;&#x5F81;&#x4E5F;&#x662F;&#x4E00;&#x79CD;&#x7279;&#x5F81;&#x3002;</p>
<p>&#x540C;&#x6837;&#x7684;&#xFF0C;&#x76EE;&#x524D;&#x7684;&#x5173;&#x4E8E;&#x6DF7;&#x6DC6;&#x6D41;&#x91CF;&#x7684;&#x8BC6;&#x522B;&#x65B9;&#x5F0F;&#x662F;&#x5426;&#x5728;&#x771F;&#x5B9E;&#x73AF;&#x5883;&#x4E2D;&#x8FDB;&#x884C;&#x8BC6;&#x522B;&#x662F;&#x6709;&#x4E89;&#x8BAE;&#x7684;&#x3002;</p>
<h3 id="&#x6076;&#x610F;&#x6D41;&#x91CF;&#x8BC6;&#x522B;"><a href="#&#x6076;&#x610F;&#x6D41;&#x91CF;&#x8BC6;&#x522B;" class="headerlink" title="&#x6076;&#x610F;&#x6D41;&#x91CF;&#x8BC6;&#x522B;"></a>&#x6076;&#x610F;&#x6D41;&#x91CF;&#x8BC6;&#x522B;</h3><p>&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x6076;&#x610F;&#x7F51;&#x7EDC;&#x670D;&#x52A1;&#x901A;&#x8FC7;&#x52A0;&#x5BC6;&#x548C;&#x96A7;&#x9053;&#x6280;&#x672F;&#x7ED5;&#x8FC7;&#x9632;&#x706B;&#x5899;&#x548C;&#x5165;&#x4FB5;&#x68C0;&#x6D4B;&#x7CFB;&#x7EDF;&#xFF0C;&#x8FD9;&#x4E9B;&#x6076;&#x610F;&#x6D41;&#x91CF;&#x901A;&#x8FC7;&#x52A0;&#x5BC6;&#x3002;&#x9690;&#x85CF;&#x4E86;&#x901A;&#x8BAF;&#x5185;&#x5BB9;&#xFF0C;&#x5BFC;&#x81F4;&#x6076;&#x610F;&#x6D41;&#x91CF;&#x5F88;&#x96BE;&#x88AB;&#x5B9E;&#x65F6;&#x76D1;&#x63A7;&#x5230;&#xFF0C;&#x5BF9;&#x4E92;&#x8054;&#x7F51;&#x5B89;&#x5168;&#x9020;&#x6210;&#x4E86;&#x4E25;&#x91CD;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x53CA;&#x65F6;&#x53D1;&#x73B0;&#x6076;&#x610F;&#x6D41;&#x91CF;&#x662F;&#x5B66;&#x672F;&#x754C;&#x548C;&#x5DE5;&#x4E1A;&#x754C;&#x9762;&#x4E34;&#x7684;&#x4E00;&#x9879;&#x5DE8;&#x5927;&#x7684;&#x6311;&#x6218;&#x3002;</p>
<p>[Yu2019]&#x8BA4;&#x4E3A;&#x7528;&#x6237;&#x6B3A;&#x8BC8;&#x7684;&#x6076;&#x610F;&#x673A;&#x5668;&#x4EBA;&#x6D41;&#x91CF;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x6765;&#x81EA;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#xFF0C;&#x5E76;&#x63D0;&#x51FA;&#x4E86;&#x4E00;&#x79CD;&#x57FA;&#x4E8E;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x5BF9;&#x6076;&#x610F;bot&#x8FDB;&#x884C;&#x8BC6;&#x522B;&#x7684;&#x51C6;&#x5B9E;&#x65F6;&#x65B9;&#x6CD5;&#xFF0C;&#x5728;&#x73B0;&#x5B9E;&#x4E16;&#x754C;&#x6570;&#x636E;&#x96C6;&#x4E2D;&#x8868;&#x73B0;&#x5F88;&#x597D;&#x3002;</p>
<p>[Wang2018]&#x901A;&#x8FC7;&#x5C06;URL&#x5411;&#x91CF;&#x5316;&#x5BF9;Android&#x8BBE;&#x5907;&#x7684;&#x6076;&#x610F;&#x8F6F;&#x4EF6;&#x8FDB;&#x884C;&#x4E86;&#x5206;&#x7C7B;&#x3002;</p>
<p>[Shekhawat2019]&#x4E5F;&#x662F;&#x901A;&#x8FC7;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x624B;&#x6BB5;&#x5BF9;&#x6076;&#x610F;&#x52A0;&#x5BC6;&#x6D41;&#x91CF;&#x548C;&#x826F;&#x6027;&#x6D41;&#x91CF;&#x8FDB;&#x884C;&#x4E86;&#x8BC6;&#x522B;&#xFF0C;&#x4ED6;&#x4EEC;&#x91C7;&#x7528;&#x4E86;&#x4E09;&#x79CD;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#xFF0C;&#x5206;&#x522B;&#x662F;&#x968F;&#x673A;&#x68EE;&#x6797;&#xFF0C;Adaboost&#xFF0C;SVM&#xFF0C;&#x503C;&#x5F97;&#x4E00;&#x63D0;&#x7684;&#x662F;&#xFF0C;&#x5728;&#x8FD9;&#x7BC7;&#x5DE5;&#x4F5C;&#x4E2D;&#xFF0C;&#x4F5C;&#x8005;&#x8FD8;&#x5BF9;&#x5404;&#x79CD;&#x53EF;&#x5229;&#x7528;&#x7684;&#x7279;&#x5F81;&#x8FDB;&#x884C;&#x4E86;&#x6574;&#x7406;&#x3002;</p>
<p>&#x7C7B;&#x4F3C;&#x5229;&#x7528;&#x7EDF;&#x8BA1;&#x7279;&#x5F81;&#x548C;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#x8FDB;&#x884C;&#x6076;&#x610F;&#x6D41;&#x91CF;&#x8BC6;&#x522B;&#x7684;&#x5DE5;&#x4F5C;&#x6709;&#x5F88;&#x591A;&#xFF0C;[Anderson2016]&#x5229;&#x7528;&#x4E86;&#x591A;&#x79CD;&#x7EDF;&#x8BA1;&#x7279;&#x5F81;&#x5982;TLS&#x63E1;&#x624B;&#x5143;&#x6570;&#x636E;&#xFF0C;&#x94FE;&#x63A5;&#x5230;&#x52A0;&#x5BC6;&#x6D41;&#x7684;DNS&#x4E0A;&#x4E0B;&#x6587;&#x6D41;&#x4EE5;&#x53CA;5&#x5206;&#x949F;&#x5185;&#x6765;&#x81EA;&#x540C;&#x4E00;&#x6E90;IP&#x5730;&#x5740;&#x7684;HTTP&#x4E0A;&#x4E0B;&#x6587;&#x6D41;&#x7684;HTTP&#x5934;&#x90E8;&#x5B57;&#x6BB5;&#x91C7;&#x7528;&#x6709;&#x76D1;&#x7763;&#x7684;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x5BF9;&#x6076;&#x610F;&#x6D41;&#x91CF;&#x8FDB;&#x884C;&#x4E86;&#x5206;&#x7C7B;&#x3002;[KLi2018]&#x4E5F;&#x662F;&#x91C7;&#x7528;HTTP&#x7684;&#x7EDF;&#x8BA1;&#x7279;&#x5F81;&#x6765;&#x68C0;&#x6D4B;&#x6765;&#x81EA;&#x6076;&#x610F;&#x8F6F;&#x4EF6;&#x7684;&#x5B89;&#x5168;&#x5A01;&#x80C1;&#x3002;&#x540C;&#x6837;&#x662F;&#x5229;&#x7528;HTTP&#x7EDF;&#x8BA1;&#x7279;&#x5F81;&#xFF0C;[Prassse2017]&#x7B49;&#x4EBA;&#x641C;&#x96C6;&#x4E86;&#x6076;&#x610F;&#x5E94;&#x7528;&#x4E0E;&#x826F;&#x6027;&#x5E94;&#x7528;&#x7684;&#x6570;&#x636E;&#x6D41;&#xFF0C;&#x5229;&#x7528;&#x57FA;&#x4E8E;&#x57DF;&#x540D;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5D4C;&#x5165;&#x548C;&#x5904;&#x7406;&#x7F51;&#x7EDC;&#x6D41;&#x7684;&#x957F;&#x77ED;&#x671F;&#x8BB0;&#x5FC6;&#x7F51;&#x7EDC;&#x8FDB;&#x884C;&#x6076;&#x610F;&#x8F6F;&#x4EF6;&#x8BC6;&#x522B;&#x3002;</p>
<p>[Anderson2017]&#x7B49;&#x4EBA;&#x7684;&#x5DE5;&#x4F5C;&#x73B0;&#x5B9E;&#x4E86;&#x7279;&#x5F81;&#x5DE5;&#x7A0B;&#x5728;&#x901A;&#x8FC7;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x8BC6;&#x522B;&#x6076;&#x610F;&#x6D41;&#x91CF;&#x4E2D;&#x8D77;&#x5230;&#x4E86;&#x51B3;&#x5B9A;&#x6027;&#x4F5C;&#x7528;&#xFF0C;&#x4ED6;&#x4EEC;&#x5BB3;&#x6BD4;&#x8F83;&#x4E86;6&#x4E2D;&#x5E38;&#x89C1;&#x7B97;&#x6CD5;&#x5728;&#x9762;&#x5BF9;&#x771F;&#x5B9E;&#x73AF;&#x5883;&#x4E0B;&#x7684;&#x6027;&#x80FD;&#xFF0C;&#x8BA4;&#x4E3A;&#x968F;&#x673A;&#x68EE;&#x6797;&#x7B97;&#x6CD5;&#x7684;&#x6548;&#x679C;&#x5728;&#x8BE5;&#x4EFB;&#x52A1;&#x4E2D;&#x8868;&#x73B0;&#x6700;&#x4E3A;&#x7A81;&#x51FA;&#x3002;</p>
<p>&#x5728;&#x68C0;&#x6D4B;&#x6076;&#x610F;&#x6D41;&#x6D6A;&#x65F6;&#xFF0C;&#x91C7;&#x7528;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x65B9;&#x6CD5;&#x7684;&#x5DE5;&#x4F5C;&#x6BD4;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x66F4;&#x591A;&#xFF0C;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x6076;&#x610F;&#x6D41;&#x91CF;&#x7684;&#x6570;&#x636E;&#x662F;&#x5C11;&#x91CF;&#x7684;&#xFF0C;&#x6B64;&#x65F6;&#x91C7;&#x7528;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x8FDB;&#x884C;&#x8BAD;&#x7EC3;&#x5F88;&#x5BB9;&#x6613;&#x8FC7;&#x62DF;&#x5408;&#x3002;</p>
<ul>
<li>&#x50F5;&#x5C38;&#x7F51;&#x7EDC;&#xFF0C;&#x7B97;&#x5417;Overview of botnet detection based on machine learning</li>
<li>Identifying Encrypted Malware Traffic with Contextual FlowData</li>
</ul>
<p>&#x9664;&#x4E86;&#x4EE5;&#x4E0A;&#x5217;&#x51FA;&#x7684;&#x4EFB;&#x52A1;&#x4E4B;&#x5916;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x5DE5;&#x4F5C;&#x50CF;[Roei2017]&#x548C;[Ran2017]&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x52A0;&#x5BC6;&#x6570;&#x636E;&#x6D41;&#x8BC6;&#x522B;&#x51FA;&#x7528;&#x6237;&#x6B63;&#x5728;&#x89C2;&#x770B;&#x7684;&#x89C6;&#x9891;&#x5185;&#x5BB9;&#x3002;</p>
<p>[Martins2018]&#x7814;&#x7A76;&#x4E86;&#x6D41;&#x91CF;&#x62E5;&#x585E;&#x95EE;&#x9898;&#xFF0C;&#x8BE5;&#x5DE5;&#x4F5C;&#x8BAD;&#x7EC3;&#x4E86;&#x5206;&#x7C7B;&#x5668;&#x5BF9;&#x6570;&#x636E;&#x6D41;&#x5206;&#x7C7B;&#xFF0C;&#x5728;SDN&#x7684;&#x73AF;&#x5883;&#x4E0B;&#x5F53;&#x7B2C;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5305;&#x5230;&#x8FBE;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x9884;&#x6D4B;&#x6D41;&#x91CF;&#x7279;&#x6027;&#x91C7;&#x53D6;&#x5408;&#x9002;&#x7684;&#x5206;&#x6D41;&#x63AA;&#x65BD;&#x7F13;&#x89E3;&#x62E5;&#x585E;&#x95EE;&#x9898;&#x3002; </p>
<p>&#x6D41;&#x91CF;&#x8BC6;&#x522B;&#x7684;&#x5E94;&#x7528;&#x975E;&#x5E38;&#x5E7F;&#x6CDB;&#xFF0C;&#x4E0A;&#x9762;&#x8FD9;&#x4E9B;&#x5DE5;&#x4F5C;&#x8BC1;&#x660E;&#x4E86;&#x867D;&#x7136;&#x6570;&#x636E;&#x5305;&#x8FDB;&#x884C;&#x4E86;&#x52A0;&#x5BC6;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x9690;&#x79C1;&#x5E76;&#x4E0D;&#x662F;&#x7EDD;&#x5BF9;&#x5B89;&#x5168;&#x7684;&#xFF0C;&#x6D41;&#x91CF;&#x7684;&#x610F;&#x56FE;&#x4ECD;&#x7136;&#x6709;&#x53EF;&#x80FD;&#x88AB;&#x8BC6;&#x522B;&#x3002;</p>
<h2 id="&#x5E38;&#x7528;&#x65B9;&#x6CD5;&#x603B;&#x7ED3;"><a href="#&#x5E38;&#x7528;&#x65B9;&#x6CD5;&#x603B;&#x7ED3;" class="headerlink" title="&#x5E38;&#x7528;&#x65B9;&#x6CD5;&#x603B;&#x7ED3;"></a>&#x5E38;&#x7528;&#x65B9;&#x6CD5;&#x603B;&#x7ED3;</h2><p>&#x76EE;&#x524D;&#x5E38;&#x7528;&#x7684;&#x6D41;&#x91CF;&#x8BC6;&#x522B;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x91C7;&#x7528;&#x7279;&#x5F81;&#x5DE5;&#x7A0B;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x5BF9;&#x539F;&#x59CB;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x4E00;&#x5B9A;&#x7684;&#x9884;&#x5904;&#x7406;&#x548C;&#x6E05;&#x6670;&#xFF0C;&#x6839;&#x636E;&#x4EFB;&#x52A1;&#x76EE;&#x6807;&#x62BD;&#x53D6;&#x5404;&#x79CD;&#x7279;&#x5F81;&#xFF0C;&#x91C7;&#x7528;&#x4E13;&#x95E8;&#x8BBE;&#x8BA1;&#x7684;&#x7B97;&#x6CD5;&#x8FDB;&#x884C;&#x8BC6;&#x522B;&#x3002;&#x8FC7;&#x53BB;&#x6BD4;&#x8F83;&#x5E38;&#x7528;&#x7684;&#x65B9;&#x5F0F;&#x662F;&#x91C7;&#x7528;&#x5B57;&#x6BB5;&#x5339;&#x914D;&#x548C;&#x6B63;&#x5219;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x5728;&#x52A0;&#x5BC6;&#x6D41;&#x91CF;&#x8D8A;&#x6765;&#x8D8A;&#x666E;&#x904D;&#x7684;&#x73B0;&#x5728;&#xFF0C;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x5DE5;&#x4F5C;&#x5229;&#x7528;&#x7EDF;&#x8BA1;&#x7279;&#x5F81;&#xFF0C;&#x91C7;&#x7528;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x548C;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7684;&#x65B9;&#x5F0F;&#x8BAD;&#x7EC3;&#x5206;&#x7C7B;&#x5668;&#x8FDB;&#x884C;&#x8BC6;&#x522B;&#x3002;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x5DE5;&#x4F5C;&#x8FDB;&#x884C;&#x4E86;&#x65E0;&#x76D1;&#x7763;&#x7684;&#x65B9;&#x5F0F;&#xFF08;&#x53BB;&#x627E;&#x4E00;&#x627E;&#xFF09;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x5C06;&#x5BF9;&#x6D41;&#x91CF;&#x8BC6;&#x522B;&#x4E2D;&#x7684;&#x5E38;&#x7528;&#x65B9;&#x6CD5;&#x548C;&#x7279;&#x5F81;&#x8FDB;&#x884C;&#x4ECB;&#x7ECD;&#x3002;</p>
<h3 id="&#x660E;&#x6587;&#x7279;&#x5F81;-&#x89C4;&#x5219;&#x5339;&#x914D;"><a href="#&#x660E;&#x6587;&#x7279;&#x5F81;-&#x89C4;&#x5219;&#x5339;&#x914D;" class="headerlink" title="&#x660E;&#x6587;&#x7279;&#x5F81;+&#x89C4;&#x5219;&#x5339;&#x914D;"></a>&#x660E;&#x6587;&#x7279;&#x5F81;+&#x89C4;&#x5219;&#x5339;&#x914D;</h3><p>&#x4F20;&#x7EDF;&#x62A5;&#x6587;&#x68C0;&#x6D4B;&#x4F1A;&#x5206;&#x6790; IP &#x5305;&#x7684;&#x6E90;&#x5730;&#x5740;&#x3001;&#x76EE;&#x7684;&#x5730;&#x5740;&#x3001;&#x6E90;&#x7AEF;&#x53E3;&#x3001;&#x76EE;&#x7684;&#x7AEF;&#x53E3;&#x4EE5;&#x53CA;&#x534F;&#x8BAE;&#x7C7B;&#x578B;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x53EF;&#x4EE5;&#x68C0;&#x67E5;&#x7AEF;&#x53E3;&#x662F;&#x5426;&#x88AB;&#x6B63;&#x5E38;&#x4F7F;&#x7528;&#xFF0C;&#x6BD4;&#x5982;443&#x7AEF;&#x53E3;&#x662F;&#x5426;&#x4F20;&#x8F93;&#x7684;&#x662F;&#x660E;&#x6587;&#x6D41;&#x91CF;&#x3002;</p>
<p>DPI&#xFF08;Deep Packet Inspection&#xFF09;&#x6DF1;&#x5EA6;&#x5305;&#x68C0;&#x6D4B;&#x6280;&#x672F;&#x662F;&#x5728;&#x4F20;&#x7EDF;&#x62A5;&#x6587;&#x68C0;&#x6D4B;&#x4E4B;&#x4E0A;&#x589E;&#x52A0;&#x4E86;&#x5BF9;&#x5E94;&#x7528;&#x5C42;&#x6570;&#x636E;&#x7684;&#x534F;&#x8BAE;&#x8BC6;&#x522B;&#xFF0C;&#x901A;&#x8FC7;&#x89E3;&#x6790;&#x5E94;&#x7528;&#x5C42;&#x6570;&#x636E;&#x6765;&#x786E;&#x5B9A;&#x6D41;&#x91CF;&#x5BF9;&#x5E94;&#x7684;&#x4E1A;&#x52A1;&#x4FE1;&#x606F;&#x3002;</p>
<p>&#x4F20;&#x7EDF;&#x62A5;&#x6587;&#x68C0;&#x6D4B;&#x548C;&#x6DF1;&#x5EA6;&#x5305;&#x68C0;&#x6D4B;&#x90FD;&#x53EF;&#x4EE5;&#x5BF9;&#x6D41;&#x91CF;&#x8FDB;&#x884C;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x7684;&#x8BC6;&#x522B;&#xFF0C;&#x4F46;&#x5F88;&#x591A;&#x65F6;&#x5019;&#xFF0C;&#x5BF9;&#x4E8E;&#x52A0;&#x5BC6;&#x6D41;&#x91CF;&#x548C;&#x6DF7;&#x6DC6;&#x540E;&#x7684;&#x6D41;&#x91CF;&#x96BE;&#x4EE5;&#x68C0;&#x6D4B;&#x3002;</p>
<p>&#x6709;&#x5F88;&#x591A;&#x5DE5;&#x4F5C;&#x90FD;&#x662F;&#x8FD9;&#x79CD;&#x57FA;&#x4E8E;&#x89C4;&#x5219;&#x7684;&#x601D;&#x60F3;&#xFF0C;&#x6BD4;&#x5982;&#x57FA;&#x4E8E;&#x8BC1;&#x4E66;&#x7684;&#x68C0;&#x6D4B;&#xFF0C;&#x57FA;&#x4E8E;&#x534F;&#x8BAE;&#x9996;&#x90E8;&#x5B57;&#x6BB5;&#x7684;&#x68C0;&#x6D4B;&#xFF0C;&#x57FA;&#x4E8E;&#x901A;&#x8BAF;&#x6A21;&#x5F0F;&#x7684;&#x68C0;&#x6D4B;&#xFF0C;&#x5BF9;&#x4E8E;&#x660E;&#x6587;&#x6570;&#x636E;&#x662F;&#x4E00;&#x79CD;&#x6781;&#x4E3A;&#x6709;&#x6548;&#x7684;&#x624B;&#x6BB5;&#xFF0C;&#x4F46;&#x4EBA;&#x5DE5;&#x5206;&#x6790;&#x7279;&#x5F81;&#x9700;&#x8981;&#x4E13;&#x5BB6;&#x5F97;&#x77E5;&#x8BC6;&#xFF0C;&#x5E76;&#x4E14;&#x5F88;&#x5BB9;&#x6613;&#x88AB;&#x62FC;&#x63A5;&#xFF0C;&#x6539;&#x9020;&#x540E;&#x7684; &#x6D41;&#x91CF;&#x89C4;&#x907F;&#xFF0C;&#x5BF9;&#x52A0;&#x5BC6;&#x6D41;&#x91CF;&#x8FD9;&#x6837;&#x7684;&#x624B;&#x6BB5;&#x8D77;&#x5230;&#x7684;&#x4F5C;&#x7528;&#x4E5F;&#x662F;&#x6709;&#x9650;&#x7684;&#x3002;</p>
<p>&#x8FD1;&#x51E0;&#x5E74;&#x6709;&#x4E0D;&#x5C11;&#x5DE5;&#x4F5C;&#x90FD;&#x91C7;&#x7528;&#x4E86;&#x8FD9;&#x79CD;&#x7C7B;&#x4F3C;&#x89C4;&#x5219;&#x5339;&#x914D;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;[Shbair2016]&#x901A;&#x8FC7;&#x5BF9;&#x6BD4;SNI&#x548C;IP&#x5BF9;&#x5E94;&#x7684;&#x57DF;&#x540D;&#x4FE1;&#x606F;&#x6765;&#x589E;&#x5F3A;&#x9632;&#x706B;&#x5899;&#x7684;&#x5B89;&#x5168;&#x6027;&#x3002;[Hus&#xE1;k2016]&#x5EFA;&#x7ACB;&#x4E86;SSL / TLS ciphersuite list&#x548C;HTTP User-Agent&#x7684;&#x5B57;&#x5178;&#xFF0C;&#x5E76;&#x5C06;User-Agent&#x5206;&#x914D;&#x7ED9;&#x89C2;&#x5BDF;&#x5230;&#x7684;SSL / TLS&#x8FDE;&#x63A5;&#xFF0C;&#x7528;&#x6765;&#x8BC6;&#x522B;&#x901A;&#x4FE1;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x3002;[Papadogiannaki2018]&#xFF0C;&#x4ECE;&#x6D41;&#x91CF;&#x4E2D;&#x63D0;&#x53D6;&#x884C;&#x4E3A;&#x7279;&#x5F81;&#xFF0C;&#x5982;&#x5305;&#x51FA;&#x73B0;&#x9891;&#x7387;&#x6216;&#x5305;&#x6240;&#x5728;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x91C7;&#x7528;&#x6B63;&#x5219;&#x5339;&#x914D;&#x56FA;&#x5B9A;&#x6A21;&#x5F0F;&#xFF0C;&#x53EF;&#x4EE5;&#x5BF9;facebook&#x4E2D;&#x7684;&#x6D88;&#x606F;&#xFF0C;&#x8BED;&#x97F3;&#x548C;&#x89C6;&#x9891;&#x6D41;&#x91CF;&#x8FDB;&#x884C;&#x533A;&#x522B;&#x3002;</p>
<h3 id="&#x7EDF;&#x8BA1;&#x7279;&#x5F81;-&#x673A;&#x5668;&#x5B66;&#x4E60;"><a href="#&#x7EDF;&#x8BA1;&#x7279;&#x5F81;-&#x673A;&#x5668;&#x5B66;&#x4E60;" class="headerlink" title="&#x7EDF;&#x8BA1;&#x7279;&#x5F81;+&#x673A;&#x5668;&#x5B66;&#x4E60;"></a>&#x7EDF;&#x8BA1;&#x7279;&#x5F81;+&#x673A;&#x5668;&#x5B66;&#x4E60;</h3><p>&#x7EDF;&#x8BA1;&#x7279;&#x5F81;&#x901A;&#x5E38;&#x662F;&#x5BF9;&#x4E8E;&#x6574;&#x6761;&#x6570;&#x636E;&#x6D41;&#x8FDB;&#x884C;&#x5904;&#x7406;[Rezaei2018]&#xFF0C;&#x4F8B;&#x5982;&#x6D41;&#x957F;&#x5EA6;&#xFF0C;&#x5E73;&#x5747;&#x5305;&#x957F;&#xFF0C;&#x6D41;&#x5F00;&#x59CB;&#x548C;&#x7ED3;&#x675F;&#x65F6;&#x95F4;&#x7B49;&#x7B49;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x8DDF;&#x591A;&#x591A;&#x4E2A;&#x5305;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x6BD4;&#x5982;&#x6700;&#x5C0F;&#x5305;&#x95F4;&#x65F6;&#x5EF6;&#xFF0C;&#x5305;&#x4E0A;&#x4E0B;&#x5173;&#x8054;&#x5C5E;&#x6027;&#x7B49;&#x3002;&#x7528;&#x7EDF;&#x8BA1;&#x7279;&#x5F81;&#x4E0D;&#x4EC5;&#x53EF;&#x4EE5;&#x5BF9;&#x660E;&#x6587;&#x4F20;&#x8F93;&#x7684;&#x6D41;&#x91CF;&#x8FDB;&#x884C;&#x5904;&#x7406;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x9488;&#x5BF9;&#x52A0;&#x5BC6;&#x6D41;&#x91CF;&#xFF0C;&#x57FA;&#x4E8E;&#x7EDF;&#x8BA1;&#x7279;&#x5F81;&#x7684;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x5206;&#x7C7B;&#x5668;&#x5DF2;&#x7ECF;&#x6210;&#x4E3A;&#x8BC6;&#x522B;&#x52A0;&#x5BC6;&#x6D41;&#x91CF;&#x7684;&#x4E3B;&#x8981;&#x624B;&#x6BB5;&#xFF0C;&#x4F46;&#x7EDF;&#x8BA1;&#x7279;&#x5F81;&#x5E76;&#x975E;&#x662F;&#x5B8C;&#x7F8E;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x6DF7;&#x6DC6;&#x6D41;&#x91CF;&#x548C;&#x6076;&#x610F;&#x6D41;&#x91CF;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5B57;&#x6BB5;&#x586B;&#x5145;&#x6216;&#x4F2A;&#x88C5;&#x6539;&#x53D8;&#x4E00;&#x5B9A;&#x7684;&#x7EDF;&#x8BA1;&#x7279;&#x5F81;&#x3002;&#x5E76;&#x4E14;&#x5F88;&#x591A;&#x5DE5;&#x4F5C;&#x7528;&#x5230;&#x7684;&#x7EDF;&#x8BA1;&#x7279;&#x5F81;&#x9700;&#x8981;&#x5BF9;&#x6574;&#x6761;&#x6D41;&#x8FDB;&#x884C;&#x5904;&#x7406;&#xFF0C;&#x4E5F;&#x5C31;&#x610F;&#x5473;&#x7740;&#x5F88;&#x96BE;&#x505A;&#x5230;&#x5B9E;&#x65F6;&#x7684;&#x68C0;&#x6D4B;&#xFF0C;&#x5982;&#x679C;&#x4EC5;&#x80FD;&#x7528;&#x4E8E;&#x79BB;&#x7EBF;&#x5206;&#x7C7B;&#xFF0C;&#x5E94;&#x7528;&#x573A;&#x666F;&#x4F1A;&#x5F88;&#x6709;&#x9650;&#x3002;</p>
<p>&#x9664;&#x6B64;&#x4E4B;&#x5916;&#xFF0C;&#x7EDF;&#x8BA1;&#x7279;&#x5F81;&#x8FD8;&#x9700;&#x8981;&#x4EBA;&#x5DE5;&#x8BBE;&#x8BA1;&#x548C;&#x6784;&#x5EFA;&#xFF0C;&#x4F9D;&#x8D56;&#x4E13;&#x4E1A;&#x7684;&#x77E5;&#x8BC6;&#x548C;&#x7ECF;&#x9A8C;&#xFF0C;&#x8FD9;&#x4E00;&#x70B9;&#x660E;&#x6587;&#x7279;&#x5F81;&#x4E5F;&#x8981;&#x76F8;&#x540C;&#x7684;&#x7F3A;&#x9677;&#xFF0C;&#x7279;&#x5F81;&#x8BBE;&#x8BA1;&#x7684;&#x597D;&#x574F;&#x4F1A;&#x5F71;&#x54CD;&#x6700;&#x7EC8;&#x8BC6;&#x522B;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x5982;&#x4F55;&#x6784;&#x9020;&#x7684;&#x7EDF;&#x8BA1;&#x7279;&#x5F81;&#x662F;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x96BE;&#x70B9;&#x3002;</p>
<p>&#x5F88;&#x591A;&#x5DE5;&#x4F5C;&#x90FD;&#x662F;&#x91C7;&#x7528;&#x7684;&#x7EDF;&#x8BA1;&#x7279;&#x5F81;&#xFF0C;&#x50CF;[K. Li2018]&#x91C7;&#x7528;HTTP&#x8BF7;&#x6C42;&#x7684;&#x7EDF;&#x8BA1;&#x7279;&#x5F81;&#x68C0;&#x6D4B;&#x6765;&#x81EA;&#x6076;&#x610F;&#x8F6F;&#x4EF6;&#x7684;&#x5B89;&#x5168;&#x5A01;&#x80C1;&#xFF0C;[Anderson2017]&#x4E5F;&#x662F;&#x91C7;&#x7528;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x5BF9;&#x7EDF;&#x8BA1;&#x7279;&#x5F81;&#x8BAD;&#x7EC3;&#x4E86;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x4ED6;&#x4EEC;&#x540C;&#x65F6;&#x8FD8;&#x8003;&#x8651;&#x4E86;&#x5E26;&#x566A;&#x58F0;&#x7684;&#x6807;&#x7B7E;&#x3002;</p>
<p>&#x5206;&#x7C7B;&#x5668;&#x7684;&#x9009;&#x62E9;&#x4E5F;&#x4F1A;&#x5BF9;&#x8BC6;&#x522B;&#x7684;&#x7ED3;&#x679C;&#x6709;&#x7740;&#x5F88;&#x5927;&#x5F71;&#x54CD;&#xFF0C;&#x6BD4;&#x8F83;&#x5E38;&#x7528;&#x7684;&#x65B9;&#x6CD5;&#x6709;&#x51B3;&#x7B56;&#x6811;&#xFF0C;&#x968F;&#x673A;&#x68EE;&#x6797;&#xFF0C;&#x6734;&#x7D20;&#x8D1D;&#x53F6;&#x65AF;&#xFF0C;Adaboost&#xFF0C;&#x6DF1;&#x5EA6;&#x68EE;&#x6797;&#x7B49;&#x7B49;&#xFF0C;&#x8FD9;&#x4E9B;&#x7B97;&#x6CD5;&#x6709;&#x7740;&#x5404;&#x81EA;&#x7684;&#x7279;&#x70B9;&#x548C;&#x4F18;&#x52BF;&#xFF0C;&#x5728;[Namdev2015]&#x8FD9;&#x7BC7;&#x7EFC;&#x8FF0;&#x4E2D;&#xFF0C;&#x5BF9;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x65B9;&#x6CD5;&#x5728;&#x6D41;&#x91CF;&#x8BC6;&#x522B;&#x4E2D;&#x7684;&#x5E94;&#x7528;&#x8FDB;&#x884C;&#x4E86;&#x4ECB;&#x7ECD;&#x3002;</p>
<h3 id="&#x5927;&#x91CF;&#x6570;&#x636E;-&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;"><a href="#&#x5927;&#x91CF;&#x6570;&#x636E;-&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;" class="headerlink" title="&#x5927;&#x91CF;&#x6570;&#x636E;+&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;"></a>&#x5927;&#x91CF;&#x6570;&#x636E;+&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;</h3><p>&#x6D41;&#x91CF;&#x8FDB;&#x884C;&#x52A0;&#x5BC6;&#x5904;&#x7406;&#x540E;&#xFF0C;&#x8C03;&#x67E5;&#x57FA;&#x4E8E;&#x89C4;&#x5219;&#x5339;&#x914D;&#x7684;&#x65B9;&#x6CD5;&#x5DF2;&#x7ECF;&#x9010;&#x6E10;&#x5931;&#x6548;&#xFF0C;&#x800C;&#x8BB8;&#x591A;&#x5DE5;&#x4F5C;&#x4E2D;&#x91C7;&#x7528;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x65B9;&#x6CD5;&#x8BAD;&#x7EC3;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x9700;&#x8981;&#x4EBA;&#x5DE5;&#x63D0;&#x53D6;&#x7279;&#x5F81;&#xFF0C;&#x800C;&#x8FD9;&#x9700;&#x8981;&#x76F8;&#x5173;&#x9886;&#x57DF;&#x7684;&#x4E13;&#x4E1A;&#x77E5;&#x8BC6;&#xFF0C;&#x5E76;&#x4E14;&#x4E0D;&#x540C;&#x534F;&#x8BAE;&#x548C;&#x5E94;&#x7528;&#x6784;&#x9020;&#x7684;&#x7279;&#x5F81;&#x53EF;&#x80FD;&#x662F;&#x4E0D;&#x540C;&#x7684;&#xFF0C;&#x5728;&#x6B64;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x4E00;&#x4E9B;&#x5DE5;&#x4F5C;&#x5C06;nlp&#x4E2D;&#x53D1;&#x5C55;&#x8FC5;&#x901F;&#x7684;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#x5E94;&#x7528;&#x5728;&#x4E86;&#x6D41;&#x91CF;&#x5206;&#x7C7B;&#x4E0A;&#xFF0C;&#x91C7;&#x7528;&#x8868;&#x793A;&#x5B66;&#x4E60;&#x7684;&#x601D;&#x60F3;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x7E41;&#x7410;&#x7684;&#x89C4;&#x5219;&#x6784;&#x9020;&#xFF0C;&#x4ECE;&#x52A0;&#x5BC6;&#x7684;&#x539F;&#x59CB;&#x4FE1;&#x606F;&#x4E2D;&#x81EA;&#x52A8;&#x63D0;&#x53D6;&#x5173;&#x952E;&#x4FE1;&#x606F;&#x5E76;&#x751F;&#x6210;&#x6709;&#x533A;&#x5206;&#x6027;&#x7684;&#x52A0;&#x5BC6;&#x6D41;&#x91CF;&#x6307;&#x7EB9;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x91C7;&#x7528;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x6D41;&#x91CF;&#x8BC6;&#x522B;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;[Rezaei2018]&#x7684;&#x7EFC;&#x8FF0;&#x4E2D;&#x5DF2;&#x7ECF;&#x8FDB;&#x884C;&#x4E86;&#x8F83;&#x4E3A;&#x8BE6;&#x7EC6;&#x7684;&#x8BBA;&#x8FF0;&#xFF0C;&#x7B80;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;&#x5C31;&#x662F;</p>
<p>&#x5728;&#x8FD9;&#x65B9;&#x9762;&#x4E5F;&#x6709;&#x5F88;&#x591A;&#x7ECF;&#x5178;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;[Lotfollahi2017]: &#x5C06;payload&#x4ECE;tcp/udp&#x5C42;&#x5F00;&#x59CB;&#x5BF9;&#x5176;&#x586B;&#x5145;&#xFF0C;&#x4FDD;&#x8BC1;&#x534F;&#x8BAE;&#x5934;&#x90E8;&#x5206;20&#x5B57;&#x8282;&#x548C;8&#x5B57;&#x8282;&#x5BF9;&#x9F50;&#xFF0C;&#x5BF9;&#x4E8E;&#x8D1F;&#x8F7D;&#x90E8;&#x5206;&#xFF0C;&#x91C7;&#x7528;&#x524D;1480&#x4E2A;&#x5B57;&#x8282;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E0D;&#x8DB3;&#x7684;&#x8D1F;&#x8F7D;&#x8FDB;&#x884C;0&#x586B;&#x5145;&#xFF0C;&#x4FDD;&#x8BC1;&#x7EF4;&#x5EA6;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x4F7F;&#x7528;ANN&#x548C;SAE&#x8FDB;&#x884C;&#x7279;&#x5F81;&#x63D0;&#x53D6;&#x751F;&#x6210;&#x6307;&#x7EB9;&#x3002;[Rimmer2018]:&#x5229;&#x7528;&#x533F;&#x540D;&#x5316;&#x7F51;&#x7EDC;tor&#x7684;&#x7279;&#x6027;&#xFF0C;&#x91C7;&#x7528;&#x957F;&#x5EA6;&#x5E8F;&#x5217;&#x7684;&#x65B9;&#x5411;&#x5E8F;&#x5217;&#x4F5C;&#x4E3A;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7F51;&#x7EDC;SAE&#x3001;CNN&#x3001;LSTM&#x7684;&#x8F93;&#x5165;&#xFF0C;&#x4ECE;&#x800C;&#x5206;&#x7C7B;&#x8BBF;&#x95EE;&#x7684;&#x7F51;&#x9875;&#x3002;[Liu2019]&#x63D0;&#x51FA;&#x4E86;&#x4E00;&#x79CD;&#x57FA;&#x4E8E;&#x8868;&#x793A;&#x5B66;&#x4E60;&#x7684;&#x6D41;&#x5E8F;&#x5217;&#x7F51;&#x7EDC;&#xFF0C;&#x4EE5;&#x53CC;&#x5411;GRU&#x4E3A;&#x57FA;&#x672C;&#x5355;&#x5143;&#xFF0C;&#x7F16;&#x7801;&#x89E3;&#x7801;&#x4E3A;&#x6574;&#x4F53;&#x7ED3;&#x6784;&#xFF0C;&#x540C;&#x65F6;&#x91C7;&#x7528;&#x91CD;&#x6784;&#x673A;&#x5236;&#x589E;&#x5F3A;&#x52A0;&#x5BC6;&#x6D41;&#x91CF;&#x6307;&#x7EB9;&#x7684;&#x8868;&#x73B0;&#x80FD;&#x529B;&#xFF0C;&#x81EA;&#x52A8;&#x5316;&#x7684;&#x4ECE;&#x539F;&#x59CB;&#x6D41;&#x91CF;&#x4FE1;&#x606F;&#x4E2D;&#x5B66;&#x4E60;&#x6709;&#x6548;&#x7279;&#x5F81;&#xFF0C;&#x63D0;&#x5347;&#x4E86;&#x5206;&#x7C7B;&#x7684;&#x7CBE;&#x5EA6;&#x3002;</p>
<p>&#x5C3D;&#x7BA1;&#x57FA;&#x4E8E;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7684;&#x8BC6;&#x522B;&#x65B9;&#x6CD5;&#x5728;&#x5DE5;&#x4F5C;&#x4E0A;&#x663E;&#x793A;&#x51FA;&#x4E86;&#x5F88;&#x597D;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x5F80;&#x5F80;&#x662F;&#x6709;&#x76D1;&#x7763;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x9700;&#x8981;&#x5927;&#x91CF;&#x7684;&#x6807;&#x6CE8;&#x6570;&#x636E;&#xFF0C;&#x5BF9;&#x4E8E;&#x6570;&#x636E;&#x7684;&#x641C;&#x96C6;&#x800C;&#x8A00;&#x662F;&#x4E00;&#x4E2A;&#x96BE;&#x70B9;&#x3002;</p>
<h3 id="&#x65B9;&#x6CD5;&#x5BF9;&#x6BD4;"><a href="#&#x65B9;&#x6CD5;&#x5BF9;&#x6BD4;" class="headerlink" title="&#x65B9;&#x6CD5;&#x5BF9;&#x6BD4;"></a>&#x65B9;&#x6CD5;&#x5BF9;&#x6BD4;</h3><p>&#x5728;&#x5B9E;&#x9A8C;&#x5BA4;&#x73AF;&#x5883;&#x4E2D;&#xFF0C;&#x4E3A;&#x4E86;&#x4ECE;&#x5F3A;&#x8C03;&#x65B9;&#x6CD5;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x5F80;&#x5F80;&#x662F;&#x91C7;&#x7528;&#x5355;&#x4E00;&#x7684;&#x7B97;&#x6CD5;&#x8FDB;&#x884C;&#x8BC6;&#x522B;&#xFF0C;&#x5728;&#x73B0;&#x5B9E;&#x7684;&#x5E94;&#x7528;&#x573A;&#x666F;&#x4E2D;&#xFF0C;&#x5DE5;&#x4E1A;&#x754C;&#x4E2D;&#x7F51;&#x7EDC;&#x6D41;&#x91CF;&#x5206;&#x6790;&#xFF08;NTA&#xFF09;&#x5927;&#x591A;&#x7ED3;&#x5408;&#x4F7F;&#x7528;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x3001;&#x9AD8;&#x7EA7;&#x5206;&#x6790;&#x548C;&#x57FA;&#x4E8E;&#x89C4;&#x5219;&#x6765;&#x68C0;&#x6D4B;&#x4F01;&#x4E1A;&#x7F51;&#x7EDC;&#x4E0A;&#x7684;&#x53EF;&#x7591;&#x6D3B;&#x52A8;&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x653E;&#x4E0D;&#x540C;&#x8BBA;&#x6587;&#x7684;&#x7279;&#x5F81;</p>
<ul>
<li><p>&#x9A6C;&#x5C14;&#x53EF;&#x592B;&#x6982;&#x7387;&#x6307;&#x7EB9;Mampf: Encrypted traffic classification based on multi-attribute markov probability fingerprints</p>
</li>
<li><p>SFC&#x65B9;&#x6CD5;&#x662F;&#x4EC0;&#x4E48;<a target="_blank" rel="noopener" href="https://ieeexplore.ieee.org/abstract/document/8538564/">An SFC-enabled approach for processing SSL/TLS encrypted traffic in Future Enterprise Networks</a></p>
</li>
<li><p>n gram&#x71B5;<a target="_blank" rel="noopener" href="https://dl.acm.org/doi/abs/10.1145/3226052.3226057">Encrypted Traffic Identification Based on N-gram Entropy and Cumulative Sum Test</a></p>
</li>
</ul>
<p>&#x8FD8;&#x6709;&#x6839;&#x636E;&#x534F;&#x8BAE;&#x5B57;&#x6BB5;&#x7279;&#x5F81;&#x7684;</p>
<p>&#x8FD8;&#x6709;&#x81EA;&#x5DF1;&#x6784;&#x9020;&#x7279;&#x5F81;&#x5411;&#x91CF;&#x7684;&#xFF0C;&#x4E00;&#x7EF4;&#x4E00;&#x7EF4;&#x9171;&#x7D2B;</p>
<p>&#x8FD9;&#x91CC;&#x53EF;&#x4EE5;&#x7ED9;&#x51FA;&#x81EA;&#x5DF1;&#x7684;&#x7ECF;&#x9A8C;&#x8FDB;&#x884C;&#x4ECB;&#x7ECD;&#xFF0C;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x7528;&#x7EDF;&#x8BA1;&#x7279;&#x5F81;&#xFF0C;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x7528;&#x673A;&#x5668;&#x5B66;&#x4E60;&#xFF0C;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x4E0A;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#xFF0C;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x4E0A;&#x805A;&#x7C7B;</p>
<h2 id="&#x6570;&#x636E;&#x96C6;&#x4ECB;&#x7ECD;"><a href="#&#x6570;&#x636E;&#x96C6;&#x4ECB;&#x7ECD;" class="headerlink" title="&#x6570;&#x636E;&#x96C6;&#x4ECB;&#x7ECD;"></a>&#x6570;&#x636E;&#x96C6;&#x4ECB;&#x7ECD;</h2><p>&#x5F88;&#x591A;&#x5DE5;&#x4F5C;&#x90FD;&#x662F;&#x91C7;&#x7528;&#x81EA;&#x5DF1;&#x6536;&#x96C6;&#x7684;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x6BD4;&#x5982;&#x5E94;&#x7528;&#x8BC6;&#x522B;&#x548C;&#x884C;&#x4E3A;&#x8BC6;&#x522B;&#x5F80;&#x5F80;&#x90FD;&#x662F;&#x9488;&#x5BF9;&#x7279;&#x5B9A;&#x7684;&#x5E94;&#x7528;&#x6216;&#x8005;&#x7279;&#x5B9A;&#x9886;&#x57DF;&#x4F7F;&#x7528;&#xFF0C;&#x6240;&#x4EE5;&#x6CA1;&#x6709;&#x516C;&#x5F00;&#x7684;&#x6570;&#x636E;&#x96C6;&#x8D44;&#x6599;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x5DE5;&#x4F5C;&#x662F;&#x5229;&#x7528;&#x4E00;&#x4E9B;&#x8F6F;&#x4EF6;&#x751F;&#x6210;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x7531;&#x4E8E;&#x6536;&#x96C6;&#x8F6F;&#x4EF6;&#x7684;&#x8981;&#x6C42;&#xFF0C;&#x4E0D;&#x9002;&#x5408;&#x516C;&#x5F00;&#x3002;&#x7531;&#x4E8E;&#x771F;&#x5B9E;&#x7F51;&#x7EDC;&#x73AF;&#x5883;&#x4E0B;&#x7684;&#x6D41;&#x91CF;&#x662F;&#x53D8;&#x5316;&#x7684;&#xFF0C;&#x4E00;&#x4E9B;&#x6570;&#x636E;&#x96C6;&#x6BD4;&#x5982;KDDCUP99&#x548C;NSL-KDD[Tavallaee2009]&#x7B49;&#x5DF2;&#x7ECF;&#x548C;&#x5F53;&#x524D;&#x7684;&#x771F;&#x5B9E;&#x7F51;&#x7EDC;&#x73AF;&#x5883;&#x5DEE;&#x5F02;&#x8F83;&#x5927;&#x3002;&#x603B;&#x4F53;&#x6765;&#x8BF4;&#xFF0C;&#x5728;&#x7F51;&#x7EDC;&#x6D41;&#x91CF;&#x6570;&#x636E;&#x96C6;&#x65B9;&#x9762;&#xFF0C;&#x5F88;&#x96BE;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x9002;&#x7528;&#x4E8E;&#x591A;&#x4E2A;&#x9886;&#x57DF;&#x7684;&#x4F18;&#x79C0;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x4F46;&#x4ECD;&#x6709;&#x4E00;&#x4E9B;&#x5DE5;&#x4F5C;&#x5C06;&#x81EA;&#x5DF1;&#x7684;&#x6570;&#x636E;&#x96C6;&#x8FDB;&#x884C;&#x516C;&#x5F00;&#x5E76;&#x4E14;&#x88AB;&#x5E7F;&#x6CDB;&#x7684;&#x4F7F;&#x7528;&#xFF0C;&#x4E0B;&#x9762;&#x4ECB;&#x7ECD;&#x52A0;&#x62FF;&#x5927;&#x7F51;&#x7EDC;&#x5B89;&#x5168;&#x7814;&#x7A76;&#x6240;CIC&#x7684;&#x51E0;&#x4E2A;&#x7ECF;&#x5178;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x6570;&#x636E;&#x96C6;&#x53EF;&#x4EE5;&#x7528;CIC&#x63D0;&#x4F9B;&#x7684;<a target="_blank" rel="noopener" href="https://www.unb.ca/cic/research/applications.html#CICFlowMeter">CICFlowMeter-V3</a>&#x5BF9;&#x7279;&#x5F81;&#x8FDB;&#x884C;&#x63D0;&#x53D6;&#x3002;&#x3002;</p>
<p>[Gerard2016]&#x52A0;&#x62FF;&#x5927;&#x7F51;&#x7EDC;&#x5B89;&#x5168;&#x7814;&#x7A76;&#x6240;&#x516C;&#x5E03;&#x7684;VPN-nonVPN dataset (ISCXVPN2016)&#xFF0C;&#x6570;&#x636E;&#x96C6;&#x4E2D;&#x5305;&#x542B;7&#x5927;&#x7C7B;&#x5E26;&#x6807;&#x7B7E;&#x7684;&#x7F51;&#x7EDC;&#x670D;&#x52A1;&#xFF0C;&#x6570;&#x636E;&#x662F;&#x901A;&#x8FC7;Wireshark&#x548C;tcpdump&#x6355;&#x83B7;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x6709;VPN&#x548C;nonVPN&#x6D41;&#x91CF;&#x3002;</p>
<p>[Iman2018]&#x901A;&#x4FE1;&#x5B89;&#x5168;&#x673A;&#x6784;(CSE)&#x548C;&#x52A0;&#x62FF;&#x5927;&#x7F51;&#x7EDC;&#x5B89;&#x5168;&#x7814;&#x7A76;&#x6240;(CIC)&#x4E4B;&#x95F4;&#x7684;&#x5408;&#x4F5C;&#x9879;&#x76EE;&#x63D0;&#x4F9B;&#x4E86;CSE-CIC-IDS2018 on AWS&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x8BE5;&#x6570;&#x636E;&#x96C6;&#x5305;&#x62EC;&#x4E03;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x653B;&#x51FB;&#x573A;&#x666F;&#xFF1A;&#x66B4;&#x529B;&#x653B;&#x51FB;&#xFF0C;Heartbleed&#xFF0C;&#x50F5;&#x5C38;&#x7F51;&#x7EDC;&#xFF0C;DoS&#xFF0C;DDoS&#xFF0C;Web&#x653B;&#x51FB;&#x4EE5;&#x53CA;&#x5185;&#x90E8;&#x7F51;&#x7EDC;&#x7684;&#x6E17;&#x900F;&#xFF0C;&#x4E3B;&#x8981;&#x5185;&#x5BB9;&#x662F;&#x6BCF;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x7F51;&#x7EDC;&#x6D41;&#x91CF;&#x548C;&#x7CFB;&#x7EDF;&#x65E5;&#x5FD7;&#x3002;</p>
<p>[Laya]&#x5B89;&#x5353;&#x6076;&#x610F;&#x6D41;&#x91CF;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x4E3B;&#x8981;&#x5305;&#x62EC;5000&#x591A;&#x4E2A;&#x8F6F;&#x4EF6;&#x7684;&#x6D41;&#x91CF;&#xFF0C;&#x5176;&#x4E2D;&#x6709;426&#x4E2A;&#x6076;&#x610F;&#x8F6F;&#x4EF6;&#xFF0C;&#x5E76;&#x4E14;&#x5C06;&#x8FD9;&#x4E9B;&#x6076;&#x610F;&#x8F6F;&#x4EF6;&#x7684;&#x6D41;&#x91CF;&#x5206;&#x4E3A;&#x4E86;4&#x7C7B;&#xFF0C;&#x5E7F;&#x544A;&#x8F6F;&#x4EF6;&#xFF0C;&#x52D2;&#x7D22;&#x8F6F;&#x4EF6;&#xFF0C;&#x6050;&#x5413;&#x8F6F;&#x4EF6;&#xFF0C;&#x77ED;&#x4FE1;&#x6076;&#x610F;&#x8F6F;&#x4EF6;&#xFF0C;&#x9664;&#x4E86;&#x7F51;&#x7EDC;&#x6D41;&#x91CF;&#x5916;&#xFF0C;&#x8FD8;&#x5305;&#x62EC;&#x4E86;&#x5404;&#x79CD;&#x65E5;&#x5FD7;&#x6587;&#x4EF6;&#x548C;&#x7535;&#x6C60;&#x72B6;&#x6001;&#x7B49;&#x7B49;&#x3002;</p>
<h2 id="&#x6311;&#x6218;&#x548C;&#x53D1;&#x5C55;"><a href="#&#x6311;&#x6218;&#x548C;&#x53D1;&#x5C55;" class="headerlink" title="&#x6311;&#x6218;&#x548C;&#x53D1;&#x5C55;"></a>&#x6311;&#x6218;&#x548C;&#x53D1;&#x5C55;</h2><p>&#x6D41;&#x91CF;&#x8BC6;&#x522B;&#x662F;&#x4E00;&#x4E2A;&#x52A0;&#x5BC6;&#x8005;&#x4E0E;&#x68C0;&#x6D4B;&#x8005;&#x5BF9;&#x6297;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x52A0;&#x5BC6;&#x65B9;&#x91C7;&#x7528;&#x5404;&#x79CD;&#x52A0;&#x5BC6;&#x624B;&#x6BB5;&#x548C;&#x6DF7;&#x6DC6;&#x624B;&#x6BB5;&#x6D88;&#x9664;&#x7279;&#x5F81;&#xFF0C;&#x68C0;&#x6D4B;&#x65B9;&#x4E5F;&#x9700;&#x8981;&#x66F4;&#x524D;&#x6CBF;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x8BC6;&#x522B;&#x66F4;&#x6709;&#x6548;&#x5730;&#x7279;&#x5F81;&#xFF0C;&#x6784;&#x5EFA;&#x65B0;&#x7684;&#x6A21;&#x578B;&#x8FDB;&#x884C;&#x8BC6;&#x522B;&#x3002;&#x4ECE;&#x8D8B;&#x52BF;&#x800C;&#x8A00;&#xFF0C;&#x66F4;&#x5F3A;&#x7684;&#x52A0;&#x5BC6;&#x662F;&#x672A;&#x6765;&#x7684;&#x8D8B;&#x52BF;&#xFF0C;&#x4F8B;&#x5982;Tor&#x7684;&#x6D41;&#x91CF;&#x6DF7;&#x6DC6;&#x63D2;&#x4EF6;OBFS&#xFF0C;&#x4ECE;obfs&#x8FDB;&#x5316;&#x5230;obfs4&#xFF0C;&#x66F4;&#x5F3A;&#x7684;&#x52A0;&#x5BC6;&#x4F7F;&#x5F97;&#x7279;&#x5F81;&#x96BE;&#x4EE5;&#x88AB;&#x53D1;&#x73B0;&#xFF0C;&#x7ED9;&#x6D41;&#x91CF;&#x8BC6;&#x522B;&#x5E26;&#x6765;&#x4E86;&#x66F4;&#x96BE;&#x7684;&#x6311;&#x6218;&#x3002;</p>
<h3 id="&#x5728;&#x771F;&#x5B9E;&#x73AF;&#x5883;&#x4E0B;&#x5B9E;&#x65F6;&#x68C0;&#x6D4B;"><a href="#&#x5728;&#x771F;&#x5B9E;&#x73AF;&#x5883;&#x4E0B;&#x5B9E;&#x65F6;&#x68C0;&#x6D4B;" class="headerlink" title="&#x5728;&#x771F;&#x5B9E;&#x73AF;&#x5883;&#x4E0B;&#x5B9E;&#x65F6;&#x68C0;&#x6D4B;"></a>&#x5728;&#x771F;&#x5B9E;&#x73AF;&#x5883;&#x4E0B;&#x5B9E;&#x65F6;&#x68C0;&#x6D4B;</h3><p>&#x76EE;&#x524D;&#x7684;&#x5F88;&#x591A;&#x5DE5;&#x4F5C;&#x90FD;&#x662F;&#x5728;&#x5B9E;&#x9A8C;&#x5BA4;&#x7684;&#x73AF;&#x5883;&#x4E2D;&#x6D4B;&#x8BD5;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x6076;&#x610F;&#x6D41;&#x91CF;&#x8BC6;&#x522B;&#x548C;&#x7F51;&#x7AD9;&#x6307;&#x7EB9;&#x7B49;&#x4EFB;&#x52A1;&#x5728;&#x771F;&#x5B9E;&#x73AF;&#x5883;&#x4E2D;&#x51C6;&#x786E;&#x7387;&#x548C;&#x53EC;&#x56DE;&#x7387;&#x90FD;&#x4F1A;&#x4E0B;&#x964D;&#x5F88;&#x591A;&#x3002;&#x5E76;&#x4E14;&#x6D41;&#x91CF;&#x8BC6;&#x522B;&#x6280;&#x672F;&#x5728;&#x843D;&#x5730;&#x90E8;&#x7F72;&#x65F6;&#xFF0C;&#x8FD8;&#x9700;&#x8981;&#x8003;&#x8651;&#x5B9E;&#x65F6;&#x6027;&#xFF0C;&#x8FD9;&#x4E5F;&#x5C31;&#x610F;&#x5473;&#x7740;&#x57FA;&#x4E8E;&#x6570;&#x636E;&#x6D41;&#x7684;&#x65B9;&#x6CD5;&#x90FD;&#x4F1A;&#x5931;&#x6548;&#xFF0C;&#x4EC5;&#x4EC5;&#x7528;&#x51E0;&#x4E2A;&#x6570;&#x636E;&#x5305;&#x8FDB;&#x884C;&#x8BC6;&#x522B;&#x4E5F;&#x4F1A;&#x5BFC;&#x81F4;&#x8F83;&#x9AD8;&#x7684;&#x5047;&#x9633;&#x6027;&#x3002;</p>
<p>&#x6BD4;&#x8F83;&#x5178;&#x578B;&#x7684;&#x5B9E;&#x65F6;&#x6D41;&#x91CF;&#x8BC6;&#x522B;&#x5DE5;&#x4F5C;&#x6709;&#xFF0C;[Shim2017]&#x63D0;&#x51FA;&#x4E86;&#x4E00;&#x79CD;&#x4F7F;&#x7528;&#x6709;&#x6548;&#x8D1F;&#x8F7D;&#x5927;&#x5C0F;&#x5E8F;&#x5217;&#x7B7E;&#x540D;&#x7684;&#x5E94;&#x7528;&#x5206;&#x7C7B;&#x65B9;&#x6CD5;&#xFF0C;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x6570;&#x636E;&#x6D41;&#x524D;N&#x4E2A;&#x6570;&#x636E;&#x5305;&#x7684;&#x987A;&#x5E8F;&#xFF0C;&#x65B9;&#x5411;&#xFF0C;&#x6709;&#x6548;&#x8D1F;&#x8F7D;&#x5927;&#x5C0F;&#x751F;&#x6210;&#x8D1F;&#x8F7D;&#x5927;&#x5C0F;&#x5E8F;&#x5217;&#x7B7E;&#x540D;&#x8FDB;&#x884C;&#x5E94;&#x7528;&#x5206;&#x7C7B;&#x3002;[Liu2017]&#x5229;&#x7528;&#x65F6;&#x95F4;&#x5207;&#x5206;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x5C06;&#x65F6;&#x95F4;&#x5E8F;&#x5217;&#x5207;&#x5206;&#x6210;&#x5C0F;&#x7247;&#x6BB5;&#xFF0C;&#x5229;&#x7528;&#x788E;&#x7247;&#x6BD4;&#x5BF9;&#x7684;&#x65B9;&#x5F0F;&#x5B9E;&#x65F6;&#x5206;&#x7C7B;&#x3002;</p>
<p>[Rezaei2019]&#x6307;&#x51FA;&#x4E00;&#x4E9B;&#x5DE5;&#x4F5C;&#x867D;&#x7136;&#x7528;&#x524D;&#x51E0;&#x4E2A;&#x6570;&#x636E;&#x5305;&#x5C31;&#x80FD;&#x5B8C;&#x6210;&#x5206;&#x7C7B;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x6837;&#x4F1A;&#x5BF9;&#x9020;&#x6210;&#x5DE8;&#x5927;&#x7684;&#x8D1F;&#x62C5;&#xFF0C;&#x5728;&#x4E00;&#x4E9B;&#x5E94;&#x7528;&#x573A;&#x666F;&#x4E2D;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x5173;&#x6CE8;&#x8F83;&#x957F;&#x7684;&#x6D41;&#x91CF;&#x3002;&#x6709;&#x4E9B;&#x7814;&#x7A76;&#x5C06;&#x6574;&#x4E2A;&#x6D41;&#x5212;&#x5206;&#x4E3A;&#x51E0;&#x4E2A;&#x90E8;&#x5206;&#xFF0C;&#x7136;&#x540E;&#x5BF9;&#x6BCF;&#x4E2A;&#x90E8;&#x5206;&#x8FDB;&#x884C;&#x5206;&#x7C7B;&#xFF0C;&#x4EE5;&#x68C0;&#x6D4B;&#x4E0D;&#x540C;&#x7684;&#x7528;&#x6237;&#x884C;&#x4E3A;[Taylor2017]&#x3002;</p>
<p>[Rezaei2018]&#x7684;&#x5DE5;&#x4F5C;&#x91C7;&#x7528;&#x4E00;&#x79CD;&#x534A;&#x76D1;&#x7763;&#x65B9;&#x6CD5;&#xFF0C;&#x4ECE;&#x800C;&#x6D88;&#x9664;&#x4E86;&#x5BF9;&#x5927;&#x578B;&#x6807;&#x8BB0;&#x6570;&#x636E;&#x96C6;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x6BCF;&#x4E2A;&#x7C7B;&#x522B;&#x4EC5;&#x7528;&#x4E86;20&#x4E2A;&#x6837;&#x672C;&#xFF0C;&#x7CBE;&#x5EA6;&#x5C31;&#x53EF;&#x4E0E;&#x5927;&#x91CF;&#x6807;&#x6CE8;&#x6570;&#x636E;&#x7684;&#x65B9;&#x6CD5;&#x76F8;&#x6BD4;&#xFF0C;&#x5E76;&#x4E14;&#x901A;&#x8FC7;&#x91C7;&#x6837;&#x7684;&#x65B9;&#x6CD5;&#x8BC1;&#x660E;&#x4E86;&#x4ECE;&#x6D41;&#x7684;&#x4EFB;&#x610F;&#x90E8;&#x5206;&#x91C7;&#x6837;&#x6570;&#x636E;&#x5305;&#x8DB3;&#x4EE5;&#x8FDB;&#x884C;&#x5206;&#x7C7B;&#x3002;</p>
<h3 id="&#x66F4;&#x5F3A;&#x52A0;&#x5BC6;&#x534F;&#x8BAE;&#x7684;&#x51FA;&#x73B0;"><a href="#&#x66F4;&#x5F3A;&#x52A0;&#x5BC6;&#x534F;&#x8BAE;&#x7684;&#x51FA;&#x73B0;" class="headerlink" title="&#x66F4;&#x5F3A;&#x52A0;&#x5BC6;&#x534F;&#x8BAE;&#x7684;&#x51FA;&#x73B0;"></a>&#x66F4;&#x5F3A;&#x52A0;&#x5BC6;&#x534F;&#x8BAE;&#x7684;&#x51FA;&#x73B0;</h3><p>&#x534F;&#x8BAE;&#x7684;&#x6539;&#x8FDB;&#x4F1A;&#x4F7F;&#x539F;&#x672C;&#x7684;&#x4E00;&#x4E9B;&#x7279;&#x5F81;&#x548C;&#x65B9;&#x6CD5;&#x5931;&#x6548;&#x3002;&#x5728;HTTP/1.1<br>&#x4E2D;&#xFF0C;&#x53EA;&#x6709;&#x524D;&#x4E00;&#x4E2A;&#x54CD;&#x5E94;&#x6536;&#x5230;&#x540E;&#x624D;&#x80FD;&#x53D1;&#x9001;&#x4E0B;&#x4E00;&#x4E2A;&#x8BF7;&#x6C42;&#x3002;&#x4E3A;&#x63D0;&#x9AD8;&#x6548;&#x7387;&#xFF0C;HTTP/2&#x63D0;&#x51FA;&#x590D;&#x7528;&#x548C;&#x5E76;&#x53D1;&#x3002;&#x6D4F;&#x89C8;&#x5668;&#x4E0D;&#x9700;&#x7B49;&#x5F85;&#x63A5;&#x6536;&#x4E0A;&#x4E00;&#x4E2A;&#x54CD;&#x5E94;&#x5C31;&#x53EF;&#x4EE5;&#x542F;&#x52A8;&#x4E0B;&#x4E00;&#x4E2A;&#x8BF7;&#x6C42;&#x3002;&#x670D;&#x52A1;&#x7AEF;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x63A5;&#x6536;&#x5230;&#x7684;&#x8BF7;&#x6C42;&#xFF0C;&#x53D1;&#x9001;&#x4EFB;&#x610F;&#x4E00;&#x4E2A;&#x54CD;&#x5E94;&#x6570;&#x636E;&#x5305;&#x3002;&#x8FD9;&#x4F7F;&#x540C;&#x65B9;&#x5411;&#x4E0A;&#x8FDE;&#x7EED;&#x975E;&#x96F6;&#x8D1F;&#x8F7D;&#x6570;&#x636E;&#x5305;&#x7B49;burst&#x7279;&#x5F81;&#x5931;&#x6548;&#x3002;</p>
<p>&#x9488;&#x5BF9;QUIC&#x7684;&#x8BC6;&#x522B;&#x5DF2;&#x7ECF;&#x6709;&#x4E00;&#x4E9B;&#x5DE5;&#x4F5C;&#x505A;&#x4E86;&#x5C1D;&#x8BD5;[Rezaei2018]&#x5E76;&#x53D6;&#x5F97;&#x4E86;&#x4E0D;&#x9519;&#x7684;&#x6548;&#x679C;&#x3002;</p>
<p>2018&#x5E74;8&#x6708;&#xFF0C;IETF&#x6B63;&#x5F0F;&#x53D1;&#x5E03;TLS1.3&#x534F;&#x8BAE;&#x7684;&#x6700;&#x7EC8;&#x7248;&#x672C; (RFC 8446)&#xFF0C;&#x5728;&#x5B89;&#x5168;&#x6027;&#x3001;&#x6027;&#x80FD;&#x548C;&#x9690;&#x79C1;&#x7B49;&#x65B9;&#x9762;&#x6709;&#x91CD;&#x5927;&#x6539;&#x8FDB;&#xFF0C;&#x540C;&#x65F6;&#x5927;&#x5927;&#x63D0;&#x5347;&#x4E86;HTTPS&#x8FDE;&#x63A5;&#x7684;&#x901F;&#x5EA6;&#x3002;</p>
<p>TLS1.3&#x5728;TLS1.2&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x505A;&#x4E86;&#x6539;&#x8FDB;&#xFF0C;&#x901A;&#x8FC7;&#x52A0;&#x5BC6;&#x66F4;&#x591A;&#x7684;&#x63E1;&#x624B;&#x8FC7;&#x7A0B; (&#x5982;&#x8BC1;&#x4E66;&#x4EA4;&#x6362;) &#x6765;&#x4FDD;&#x62A4;&#x5176;&#x514D;&#x53D7;&#x7A83;&#x542C;&#x8005;&#x7684;&#x4FB5;&#x5BB3;&#xFF0C;&#x4ECE;&#x800C;&#x4E3A;&#x6570;&#x636E;&#x4EA4;&#x6362;&#x63D0;&#x4F9B;&#x66F4;&#x5F3A;&#x7684;&#x9690;&#x79C1;&#x6027;&#x3002;ESNI&#xFF08;&#x52A0;&#x5BC6;SNI&#xFF09;&#x662F;TLS1.3&#x534F;&#x8BAE;&#x7684;&#x6269;&#x5C55;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x963B;&#x6B62;ISP&#x3001;WiFi&#x548C;&#x5176;&#x4ED6;&#x76D1;&#x63A7;&#x8005;&#x62E6;&#x622A;TLS&#x6269;&#x5C55;&#x6A21;&#x5757;&#x4E2D;&#x7684;SNI&#xFF0C;&#x9632;&#x6B62;&#x7528;&#x6237;&#x8BBF;&#x95EE;&#x7F51;&#x7AD9;&#x7684;&#x6D4F;&#x89C8;&#x8BB0;&#x5F55;&#x88AB;&#x6CC4;&#x9732;&#xFF0C;ESNI&#x8BA9;&#x4F7F;&#x7528;HTTPS&#x7684;&#x4E92;&#x8054;&#x7F51;&#x7528;&#x6237;&#x66F4;&#x96BE;&#x88AB;&#x8DDF;&#x8E2A;&#x3002;</p>
<p>&#x9664;&#x4E86;&#x65B0;&#x51FA;&#x73B0;&#x7684;&#x901A;&#x7528;&#x534F;&#x8BAE;&#x5916;&#xFF0C;&#x4E00;&#x4E9B;&#x6076;&#x610F;&#x6D41;&#x91CF;&#x91C7;&#x7528;&#x81EA;&#x5B9A;&#x4E49;&#x7684;&#x534F;&#x8BAE;&#x7EE7;&#x7EED;&#x52A0;&#x5BC6;&#xFF0C;&#x4F8B;&#x5982;APT&#x653B;&#x51FB;&#x6D3B;&#x52A8;&#x7EC4;&#x7EC7;Wild Neutron&#x4F7F;&#x7528;&#x7684;&#x6076;&#x610F;&#x8F6F;&#x4EF6;&#x4E0E;C&amp;C&#x670D;&#x52A1;&#x5668;&#x7684;&#x901A;&#x4FE1;&#x90FD;&#x662F;&#x4F7F;&#x7528;&#x81EA;&#x5B9A;&#x4E49;&#x7684;&#x534F;&#x8BAE;&#x8FDB;&#x884C;&#x52A0;&#x5BC6;&#xFF0C;&#x5BF9;&#x4E8E;&#x8FD9;&#x7C7B;&#x60C5;&#x51B5;&#xFF0C;&#x7279;&#x5F81;&#x5F88;&#x96BE;&#x63D0;&#x53D6;&#x5230;&#xFF0C;&#x5E76;&#x4E14;&#x6570;&#x636E;&#x6536;&#x96C6;&#x8F83;&#x4E3A;&#x56F0;&#x96BE;&#xFF0C;&#x4ECD;&#x662F;&#x4E00;&#x4E2A;&#x503C;&#x5F97;&#x7814;&#x7A76;&#x7684;&#x65B9;&#x5411;&#x3002;</p>
<h3 id="&#x672A;&#x77E5;&#x6D41;&#x91CF;&#x8BC6;&#x522B;"><a href="#&#x672A;&#x77E5;&#x6D41;&#x91CF;&#x8BC6;&#x522B;" class="headerlink" title="&#x672A;&#x77E5;&#x6D41;&#x91CF;&#x8BC6;&#x522B;"></a>&#x672A;&#x77E5;&#x6D41;&#x91CF;&#x8BC6;&#x522B;</h3><p>&#x672A;&#x77E5;&#x6D41;&#x91CF;&#x8BC6;&#x522B;&#x53EF;&#x4EE5;&#x4ECE;&#x6D41;&#x91CF;&#x4E2D;&#x53D1;&#x73B0;&#x6F5C;&#x5728;&#x7684;&#x5A01;&#x80C1;</p>
<blockquote>
<p>&#x8FD9;&#x90E8;&#x5206;&#x53EF;&#x4EE5;&#x53C2;&#x8003;&#x718A;&#x521A;&#x8001;&#x5E08;&#x7684;&#x62A5;&#x544A;</p>
</blockquote>
<h3 id="&#x5728;&#x771F;&#x5B9E;&#x73AF;&#x5883;&#x4E0B;&#xFF08;&#x4E00;&#x76F4;&#x4EE5;&#x6765;&#x7684;&#x95EE;&#x9898;&#xFF09;"><a href="#&#x5728;&#x771F;&#x5B9E;&#x73AF;&#x5883;&#x4E0B;&#xFF08;&#x4E00;&#x76F4;&#x4EE5;&#x6765;&#x7684;&#x95EE;&#x9898;&#xFF09;" class="headerlink" title="&#x5728;&#x771F;&#x5B9E;&#x73AF;&#x5883;&#x4E0B;&#xFF08;&#x4E00;&#x76F4;&#x4EE5;&#x6765;&#x7684;&#x95EE;&#x9898;&#xFF09;"></a>&#x5728;&#x771F;&#x5B9E;&#x73AF;&#x5883;&#x4E0B;&#xFF08;&#x4E00;&#x76F4;&#x4EE5;&#x6765;&#x7684;&#x95EE;&#x9898;&#xFF09;</h3><p>&#x53EF;&#x80FD;&#x7ED3;&#x5408;&#x4E00;&#x4E9B;&#x66F4;&#x65B0;&#x7684;&#x5206;&#x7C7B;&#x6280;&#x672F;&#xFF0C;&#x6BD4;&#x5982;&#x6EAF;&#x6E90;&#x56FE;</p>
<h3 id="&#x4E0D;&#x5E73;&#x8861;&#x6D41;&#x91CF;&#x7684;&#x5206;&#x7C7B;&#x95EE;&#x9898;"><a href="#&#x4E0D;&#x5E73;&#x8861;&#x6D41;&#x91CF;&#x7684;&#x5206;&#x7C7B;&#x95EE;&#x9898;" class="headerlink" title="&#x4E0D;&#x5E73;&#x8861;&#x6D41;&#x91CF;&#x7684;&#x5206;&#x7C7B;&#x95EE;&#x9898;"></a>&#x4E0D;&#x5E73;&#x8861;&#x6D41;&#x91CF;&#x7684;&#x5206;&#x7C7B;&#x95EE;&#x9898;</h3><p>&#x6027;&#x80FD;&#x95EE;&#x9898;</p>
<ul>
<li>PCCN:&#x7528;&#x4E8E;&#x591A;&#x7C7B;&#x4E0D;&#x5E73;&#x8861;&#x7F51;&#x7EDC;&#x6D41;&#x91CF;&#x5F02;&#x5E38;&#x7F51;&#x7EDC;&#x6D41;&#x91CF;&#x68C0;&#x6D4B;&#x7684;&#x5E76;&#x884C;&#x4EA4;&#x53C9;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;<a target="_blank" rel="noopener" href="https://ieeexplore.ieee.org/abstract/document/8787567/">PCCN: Parallel Cross Convolutional Neural Network for Abnormal Network Traffic Flows Detection in Multi-Class Imbalanced Network Traffic Flows</a></li>
</ul>
<p>&#x6211;&#x4E2A;&#x4EBA;&#x7684;&#x770B;&#x6CD5;&#xFF0C;&#x6D41;&#x91CF;&#x8BC6;&#x522B;&#x9700;&#x8981;&#x7684;&#x521B;&#x65B0;&#x70B9;&#x5728;&#x54EA;&#x91CC;&#xFF1F;&#x4E00;&#x4E2A;&#x662F;&#x6784;&#x9020;&#x7279;&#x5F81;&#xFF0C;&#x7ED3;&#x5408;&#x534F;&#x8BAE;&#x4F1A;&#x66F4;&#x6709;&#x7F51;&#x7EDC;&#x7279;&#x5F81;&#x3002;</p>
<h2 id="&#x53C2;&#x8003;"><a href="#&#x53C2;&#x8003;" class="headerlink" title="&#x53C2;&#x8003;"></a>&#x53C2;&#x8003;</h2><p>&#x672C;&#x6587;&#x4E3B;&#x8981;&#x53C2;&#x8003;&#x4E86;&#x4E0B;&#x9762;&#x51E0;&#x7BC7;&#x7EFC;&#x8FF0;&#x6216;&#x8C03;&#x7814;&#xFF1A;</p>
<p><a target="_blank" rel="noopener" href="https://gist.github.com/klzgrad/73a6365c895e02d0e5d879cad1ffb691">klzgrad&#x7684;&#x6D41;&#x91CF;&#x5206;&#x6790;survey</a></p>
<p>&#x718A;&#x521A;&#x8001;&#x5E08;ISC2019&#x7684;&#x62A5;&#x544A;</p>
<p>Deep Learning for Encrypted Traffic Classification: An Overview</p>
<blockquote>
<p>&#x5F15;&#x7528;</p>
<p>X. Zeng <em>et al</em>., &#x201C;Flow Context and Host Behavior Based Shadowsocks&#x2019;s Traffic Identification,&#x201D; in <em>IEEE Access</em>, vol. 7, pp. 41017-41032, 2019, doi: 10.1109/ACCESS.2019.2907149.</p>
<p>Dixon L, Ristenpart T, Shrimpton T. Network traffic obfuscation and automated internet censorship[J]. IEEE Security &amp; Privacy, 2016, 14(6): 43-53.</p>
<p>Rimmer V, Preuveneers D, Juarez M, et al. Automated feature extraction for website fingerprinting through deep learning[J]. arXiv preprint arXiv, 2017, 1708.</p>
<p>Rezaei S, Liu X. How to achieve high classification accuracy with just a few labels: A semi-supervised approach using sampled packets[J]. arXiv preprint arXiv:1812.09761, 2018.</p>
<p>Wang J, Cao Z, Kang C, et al. User Behavior Classification in Encrypted Cloud Camera Traffic[C]//2019 IEEE Global Communications Conference (GLOBECOM). IEEE, 2019: 1-6.</p>
<p>K. Liang, G. Gou, C. Kang, C. Liu, M. Yang and Y, Guo. &#x201C;A Multi-view Deep Learning Model For Encrypted Website Service Classification,&#x201D; 2019 IEEE Global Communications Conference, 2019.</p>
<p>K. Li, R. Chen, L. Gu, C. Liu and J. Yin, &#x201C;A Method Based on Statistical Characteristics for Detection Malware Requests in Network Traffic,&#x201D; 2018 IEEE Third International Conference on Data Science in Cyberspace (DSC), Guangzhou, 2018, pp. 527-532, doi: 10.1109/DSC.2018.00084.</p>
<p>Anderson B, McGrew D. Machine learning for encrypted malware traffic classification: accounting for noisy labels and non-stationarity[C]//Proceedings of the 23rd ACM SIGKDD International Conference on knowledge discovery and data mining. 2017: 1723-1732.</p>
<p>Mohammad Lotfollahi, Ramin Shirali Hossein Zade, Mahdi Jafari Siavoshani, Mohammdsadegh Saberian. Deep Packet: A Novel Approach For Encrypted Traffic Classification Using Deep Learning. CoRR abs/1709.02656 (2017)</p>
<p>Ensafi R, Fifield D, Winter P, et al. Examining how the Great Firewall discovers hidden circumvention servers[C]//Proceedings of the 2015 Internet Measurement Conference. 2015: 445-458.</p>
<p>Namdev N, Agrawal S, Silkari S. Recent advancement in machine learning based internet traffic classification[J]. Procedia Computer Science, 2015, 60: 784-791.</p>
<p>Wright C V, Coull S E, Monrose F. Traffic Morphing: An Efficient Defense Against Statistical Traffic Analysis[C]//NDSS. 2009, 9.</p>
<p>C. Liu, Z. Cao, G. Xiong, G. Gou, S. Yiu and L. He, &#x201C;MaMPF: Encrypted Traffic Classification Based on<br>Multi-Attribute Markov Probability Fingerprints,&#x201D; 2018 IEEE/ACM 26th International Symposium on<br>Quality of Service (IWQoS), Banff, AB, Canada, 2018.</p>
<p>Y.Guo, J.Shi, Z. Cao , ,C. Kang ,G. Xiong , and Z.Li ,&#x201D;Machine Learning Based CloudBot Detection<br>Using Multi-layer Traffic Statistics&#x201D; IEEE HPCC 2019 - IEEE High Performance Computing and<br>Communications, Zhangjiajie, China, 2019.</p>
<p>Taylor V F, Spolaor R, Conti M, et al. Robust smartphone app identification via encrypted network traffic analysis[J]. IEEE Transactions on Information Forensics and Security, 2017, 13(1): 63-78.</p>
<p>M. Jiang, G. Gou, J. Shi and G. Xiong, &#x201C;I Know What You Are Doing With Remote Desktop,&#x201D; 2019 IEEE 38th International Performance Computing and Communications Conference (IPCCC), London, United Kingdom, 2019, pp. 1-7, doi: 10.1109/IPCCC47392.2019.8958721.</p>
<p>X. Liu, J.Wang, Y. Yang and G. Xiong, &#x201C; Inferring Behaviors via Encrypted Video Surveillance Traffic by<br>Machine Learning,&#x201D; IEEE HPCC 2019 - IEEE High Performance Computing and Communications,<br>Zhangjiajie, China, 2019.</p>
<p>Liu C, Cao Z, Xiong G, et al. Mampf: Encrypted traffic classification based on multi-attribute markov probability fingerprints[C]//2018 IEEE/ACM 26th International Symposium on Quality of Service (IWQoS). IEEE, 2018: 1-10.</p>
<p>A. Sivanathan et al., &#x201C;Classifying IoT Devices in Smart Environments Using Network Traffic Characteristics,&#x201D; in IEEE Transactions on Mobile Computing, vol. 18, no. 8, pp. 1745-1759, 1 Aug. 2019, doi: 10.1109/TMC.2018.2866249.</p>
<p>Cao J, Yang Z, Sun K, et al. Fingerprinting {SDN} Applications via Encrypted Control Traffic[C]//22nd International Symposium on Research in Attacks, Intrusions and Defenses ({RAID} 2019). 2019: 501-515.</p>
<p>R. Dubin, A. Dvir, O. Pele and O. Hadar, &#x201C;I Know What You Saw Last Minute&#x2014;Encrypted HTTP Adaptive Video Streaming Title Classification,&#x201D; in IEEE Transactions on Information Forensics and Security, vol. 12, no. 12, pp. 3039-3049, Dec. 2017, doi: 10.1109/TIFS.2017.2730819.</p>
<p>Schuster R, Shmatikov V, Tromer E. Beauty and the burst: Remote identification of encrypted video streams[C]//26th {USENIX} Security Symposium ({USENIX} Security 17). 2017: 1357-1374.</p>
<p>Y. Guo, J. Shi, Z. Cao, C. Kang, G. Xiong and Z. Li, &#x201C;Machine Learning Based CloudBot Detection Using Multi-Layer Traffic Statistics,&#x201D; 2019 IEEE 21st International Conference on High Performance Computing and Communications; IEEE 17th International Conference on Smart City; IEEE 5th International Conference on Data Science and Systems (HPCC/SmartCity/DSS), Zhangjiajie, China, 2019, pp. 2428-2435, doi: 10.1109/HPCC/SmartCity/DSS.2019.00339.</p>
<p>Rezaei S, Liu X. Deep learning for encrypted traffic classification: An overview[J]. IEEE communications magazine, 2019, 57(5): 76-81.</p>
<p>Shim K S, Ham J H, Sija B D, et al. Application traffic classification using payload size sequence signature[J]. International Journal of Network Management, 2017, 27(5): e1981.</p>
<p>Liu J, Fu Y, Ming J, et al. Effective and real-time in-app activity analysis in encrypted internet traffic streams[C]//Proceedings of the 23rd ACM SIGKDD International Conference on Knowledge Discovery and Data Mining. 2017: 335-344.</p>
<p>Wang S, Chen Z, Yan Q, et al. Deep and broad learning based detection of android malware via network traffic[C]//2018 IEEE/ACM 26th International Symposium on Quality of Service (IWQoS). IEEE, 2018: 1-6.</p>
<p>Shekhawat A S, Di Troia F, Stamp M. Feature analysis of encrypted malicious traffic[J]. Expert Systems with Applications, 2019, 125: 130-141.</p>
<p>K. Li, R. Chen, L. Gu, C. Liu and J. Yin, &#x201C;A Method Based on Statistical Characteristics for Detection Malware Requests in Network Traffic,&#x201D; 2018 IEEE Third International Conference on Data Science in Cyberspace (DSC), Guangzhou, 2018, pp. 527-532, doi: 10.1109/DSC.2018.00084.</p>
<p>Anderson B, McGrew D. Machine learning for encrypted malware traffic classification: accounting for noisy labels and non-stationarity[C]//Proceedings of the 23rd ACM SIGKDD International Conference on knowledge discovery and data mining. 2017: 1723-1732.</p>
<p>Prasse P, Machlica L, Pevn&#xFD; T, et al. Malware detection by analysing encrypted network traffic with neural networks[C]//Joint European Conference on Machine Learning and Knowledge Discovery in Databases. Springer, Cham, 2017: 73-88.</p>
<p>Anderson B, McGrew D. Identifying encrypted malware traffic with contextual flow data[C]//Proceedings of the 2016 ACM workshop on artificial intelligence and security. 2016: 35-46.</p>
<p>Martins R A S. Predicting Traffic Flow Size and Duration[D]. , 2018.</p>
<p>Shbair W M, Cholez T, Fran&#xE7;ois J, et al. Improving sni-based https security monitoring[C]//2016 IEEE 36th International Conference on Distributed Computing Systems Workshops (ICDCSW). IEEE, 2016: 72-77.</p>
<p>Gerard Drapper Gil, Arash Habibi Lashkari, Mohammad Mamun, Ali A. Ghorbani, &#x201C;Characterization of Encrypted and VPN Traffic Using Time-Related Features&#x201D;, In Proceedings of the 2nd International Conference on Information Systems Security and Privacy(ICISSP 2016) , pages 407-414, Rome, Italy.</p>
<p>M. Tavallaee, E. Bagheri, W. Lu, and A. Ghorbani, &#x201C;A Detailed Analysis of the KDD CUP 99 Data Set,&#x201D; <em>Submitted to Second IEEE Symposium on Computational Intelligence for Security and Defense Applications (CISDA)</em>, 2009.</p>
<p>Iman Sharafaldin, Arash Habibi Lashkari, and Ali A. Ghorbani, &#x201C;Toward Generating a New Intrusion Detection Dataset and Intrusion Traffic Characterization&#x201D;, 4th International Conference on Information Systems Security and Privacy (ICISSP), Portugal, January 2018</p>
<p>Laya Taheri, Andi Fitriah Abdulkadir, Arash Habibi Lashkari; Extensible Android Malware Detection and Family Classification Using Network-Flows and API-Calls, The IEEE (53rd) International Carnahan Conference on Security Technology, India, 2019</p>
</blockquote>

      
    </div>
    
    
    

    

    

    

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/NertWork/" rel="tag"># NertWork</a>
          
        </div>
      

      
      
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2021/01/06/TLS%E7%9A%84%E4%B8%89%E4%B8%AA%E9%9A%8F%E6%9C%BA%E6%95%B0%E7%9A%84%E4%BD%9C%E7%94%A8/" rel="next" title="TLS的三个随机数的作用">
                <i class="fa fa-chevron-left"></i> TLS的三个随机数的作用
              </a>
            
          </div>

          <span class="post-nav-divider"></span>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2021/03/12/%E8%AE%A8%E8%AE%BA%EF%BC%9A%E6%95%B0%E6%8D%AE%E5%BA%93%E9%81%87%E4%B8%8A%E6%9C%BA%E5%99%A8%E5%AD%A6%E4%B9%A0/" rel="prev" title="讨论：数据库遇上机器学习">
                讨论：数据库遇上机器学习 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </div>
  
  
  
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          

  



        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    
    <div class="sidebar-inner">

      

      

      <section class="site-overview-wrap sidebar-panel sidebar-panel-active">
        <div class="site-overview">
          <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
            
              <img class="site-author-image" itemprop="image"
                src="/images/me2.png"
                alt="" />
            
              <p class="site-author-name" itemprop="name"></p>
              <p class="site-description motion-element" itemprop="description"></p>
          </div>

          <nav class="site-state motion-element">

            
              <div class="site-state-item site-state-posts">
              
                <a href="/archives/%7C%7C%20archive">
              
                  <span class="site-state-item-count">52</span>
                  <span class="site-state-item-name">日志</span>
                </a>
              </div>
            

            

            
              
              
              <div class="site-state-item site-state-tags">
                
                  <span class="site-state-item-count">14</span>
                  <span class="site-state-item-name">标签</span>
                
              </div>
            

          </nav>

          

          
            <div class="links-of-author motion-element">
                
                  <span class="links-of-author-item">
                    <a href="https://github.com/heatao" target="_blank" title="GitHub">
                      
                        <i class="fa fa-fw fa-github"></i>GitHub</a>
                  </span>
                
                  <span class="links-of-author-item">
                    <a href="mailto:heatao59@gmail.com" target="_blank" title="E-Mail">
                      
                        <i class="fa fa-fw fa-envelope"></i>E-Mail</a>
                  </span>
                
            </div>
          

          
          

          
          

          

        </div>
      </section>

      

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright">&copy; <span itemprop="copyrightYear">2021</span>
  <span class="with-love">
    <i class="fa fa-user"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">HEATAO</span>

  
</div>


  <div class="powered-by">由 <a class="theme-link" target="_blank" href="https://hexo.io">Hexo</a> 强力驱动</div>



  <span class="post-meta-divider">|</span>



  <div class="theme-info">主题 &mdash; <a class="theme-link" target="_blank" href="https://github.com/iissnan/hexo-theme-next">NexT.Gemini</a> v5.1.4</div>




        







        
      </div>
    </footer>

    
      <div class="back-to-top">
        <i class="fa fa-arrow-up"></i>
        
      </div>
    

    

  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  












  
  
    <script type="text/javascript" src="/lib/jquery/index.js?v=2.1.3"></script>
  

  
  
    <script type="text/javascript" src="/lib/fastclick/lib/fastclick.min.js?v=1.0.6"></script>
  

  
  
    <script type="text/javascript" src="/lib/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>
  

  
  
    <script type="text/javascript" src="/lib/velocity/velocity.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="/lib/velocity/velocity.ui.min.js?v=1.2.1"></script>
  

  
  
    <script type="text/javascript" src="/lib/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>
  


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.1.4"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.1.4"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=5.1.4"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=5.1.4"></script>



  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.1.4"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.1.4"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.1.4"></script>



  


  




	





  





  












  





  

  

  

  
  

  

  

  

<script src="/public/public/live2dw/public/public/live2dw/public/lib/L2Dwidget.min.js?094cbace49a39548bed64abff5988b05"></script><script>L2Dwidget.init({"pluginRootPath":"public/public/live2dw/","pluginJsPath":"public/public/live2dw/public/lib/","pluginModelPath":"node_modules/live2d-widget-model-shizuku/assets/","tagMode":false,"debug":false,"model":{"jsonPath":"/public/public/live2dw/node_modules/live2d-widget-model-shizuku/assets/assets/shizuku.model.json"},"display":{"position":"left","width":145,"height":315,"hOffset":198,"vOffset":0},"mobile":{"show":true,"scale":0.5},"react":{"opacityDefault":0.7,"opacityOnHover":0.8},"log":false});</script></body>
</html>
